[{"slug":"4d-gantt","title":"مخطط جانت 4D","description":"إنشاء جداول زمنية وربط المهام بكائنات المشروع وتصور الجداول كمحاكاة 4D.","category":"الأدوات الرئيسية","content":"مخطط جانت 4D هو أداة جدولة قوية تحل محل أدوات الجدولة المنفصلة مثل MS Project أو Primavera. يُستخدم لإدارة جداول المشروع.\r\n\r\nشريط الأدوات\r\n\r\nاستيراد استيراد الجدول من MS Project و Primavera وتنسيقات IFC\r\nتصدير تصدير الجدول إلى MS Project و Primavera و PDF و PNG و Excel أو iCal\r\nتعيين كخط أساس حفظ الجدول الحالي كخط أساس للمقارنة\r\nتراجع / إعادة التراجع عن التغييرات أو إعادتها\r\n\r\nالمهام\r\n\r\nإضافة مهام بزر الإضافة\r\nتعديل اسم المهمة وتاريخ البدء والانتهاء والمدة والتقدم\r\nهيكل هرمي: يمكن أن تحتوي المهام على مهام فرعية\r\nربط المهام ببعضها بالتبعيات (FS, FF, SS, SF)\r\n\r\nمحاكاة 4D\r\n\r\nاربط المهام بكائنات النموذج وتصور الجدول كمحاكاة 4D. باستخدام أداة الخط الزمني يمكنك تشغيل الرسوم المتحركة ورؤية تقدم المشروع عبر الزمن."},{"slug":"calculations","title":"الحسابات","description":"جمع كميات المشروع أو النماذج حتى على مستوى الكائنات.","category":"الأدوات الرئيسية","content":"أداة الحساب هي حساب جداول بيانات قوي يتيح الحسابات بناءً على البيانات الوصفية لكائنات نموذج البيانات.\r\n\r\nالوظائف\r\n\r\nجديد إنشاء حساب جديد\r\nالاسم اسم الحساب\r\nالمستوى الحساب يعتمد على سمات الملف أو الكائن\r\nحفظ حفظ الحساب الحالي\r\nتصدير تصدير الحساب الحالي بتنسيق Excel\r\n\r\nجدول البيانات\r\n\r\nالبيانات اختر محتوى العمود الأول\r\n  المجلد فصل الصفوف حسب مجلدات شجرة البيانات\r\n  السمة فصل الصفوف حسب قيم سمات الكائن\r\nالعمود اختر محتوى الحساب للأعمدة\r\n  الملخص حساب المجموع الكلي لقيم السمات المحددة\r\n  الكمية عد عدد الكائنات\r\n\r\nقواعد الخلايا\r\n\r\nيمكن أن تحتوي خلايا الجدول على جميع أنواع المعادلات. تقريباً نفس المعادلات المدعومة في Excel.\r\n\r\nنصائح\r\n\r\nإنشاء حساب تكلفة سريع: اختر البيانات: السمة \"المادة\" العمود: السمة \"الحجم\". أضف أعمدة \"سعر الوحدة\" و\"السعر الإجمالي\" بمعادلاتك الخاصة."},{"slug":"clipping-plane","title":"مستوى القطع","description":"قطع النماذج أفقياً أو عمودياً أو على طول خط محور الطريق.","category":"الأدوات الرئيسية","content":"تُستخدم أداة مستوى القطع لقص النماذج وإنشاء مقاطع عرضية في الفضاء ثلاثي الأبعاد.\r\n\r\nأفقي\r\n\r\nمستوى القطع الأفقي يقطع النماذج أفقياً. هذا مفيد لفحص مثلاً مخططات طوابق المباني.\r\n\r\nعمودي\r\n\r\nمستوى القطع العمودي يقطع النماذج عمودياً على طول خط مستقيم بين نقطتين. هذا مفيد لفحص مثلاً هياكل المباني على طول خط الجدار.\r\n\r\nعلى طول محور الطريق\r\n\r\nالقطع على طول محور الطريق يقطع النماذج بشكل مشابه للقطع العمودي، لكن بشكل عمودي على محور الطريق وعلى طوله. يمكنك ضبط موضع مستوى القطع برقم المحطة."},{"slug":"data-management","title":"إدارة البيانات","description":"إضافة وتعديل وتنظيم مصادر بيانات المشروع.","category":"الأدوات الرئيسية","content":"تُستخدم أداة شجرة البيانات لإدارة جميع مصادر بيانات المشروع وتنظيمها في مجلدات وإدارة حقوق الوصول والتحكم في كيفية ظهور البيانات في العروض ثلاثية الأبعاد.\r\n\r\nشريط الأدوات\r\n\r\nإضافة بيانات يفتح حواراً بعلامات تبويب لأنواع البيانات المختلفة\r\nإضافة مجلد يضيف مجلداً جديداً تحت المجلد المحدد حالياً\r\nتحديث البيانات تحميل نسخة جديدة من ملف النموذج\r\nتنزيل تنزيل ملف البيانات المحدد\r\nإعدادات البيانات ضبط إعدادات مصدر البيانات المحدد\r\nإعادة تسمية إعادة تسمية مصدر البيانات\r\nإخفاء جعل مصدر البيانات مرئياً / إخفاؤه\r\nتقريب للبيانات نقل العرض الحالي ليتناسب مع مصدر البيانات\r\nإعادة استيراد إعادة استيراد مصدر البيانات المحدد\r\nحذف حذف البيانات المحددة"},{"slug":"display-modes","title":"أوضاع العرض","description":"التبديل بين أوضاع 2D و3D وGPS وملء الشاشة والواقع الافتراضي.","category":"الأساسيات","content":"تحتوي الأداة على أوضاع العرض التالية:\r\n\r\n3D – الوضع الافتراضي الذي يعرض المنظر في وضع المنظور ثلاثي الأبعاد\r\n2D – عرض من الأعلى متساوي القياس، يُعرف أيضاً بـ\"عرض الخريطة\". يزيل عرض المنظور.\r\nGPS – ينشّط تحديد موقع GPS للجهاز ويُقرّب إلى موقع الجهاز. يحتوي وضع GPS أيضاً على وضع البوصلة الذي يدير عرض المستخدم حسب نقاط بوصلة الجهاز.\r\nVR – ينشّط وضع العرض المزدوج الذي يعرض صورة مُصيّرة لكلتا العينين. يمكن استخدامه مع نظارات الواقع الافتراضي التي تدعم أوضاع العرض هذه."},{"slug":"feedback-report","title":"تقرير التغذية الراجعة","description":"تجميع كل التغذية الراجعة في جدول واحد وتصديرها إلى Excel للتحليل المفصل.","category":"الأدوات الرئيسية","content":"يُستخدم تقرير التغذية الراجعة لتجميع كل التغذية الراجعة في جدول واحد لتسهيل تحليل التغذية الراجعة.\r\n\r\nالوظائف\r\n\r\nتصفح ردود التغذية الراجعة في الجدول\r\nتصدير جدول التغذية الراجعة كملف Excel للتحليل الإضافي\r\nردود الرموز التعبيرية تُخزّن كأرقام في ملف Excel بترتيب أيقونة الرمز التعبيري (الافتراضي 0 = سعيد جداً و4 = غير سعيد جداً)\r\n\r\nنصائح\r\n\r\nإجراء إحصائيات التغذية الراجعة في Excel بحساب المتوسط والوسيط وما إلى ذلك لنتائج التغذية الراجعة\r\nتحليل التغذية الراجعة بالذكاء الاصطناعي بتنزيل التقرير إلى Excel وطرح أسئلة على الذكاء الاصطناعي"},{"slug":"feedback","title":"التغذية الراجعة","description":"إعطاء تغذية راجعة منظمة بنماذج تغذية راجعة قابلة للتخصيص.","category":"الأدوات الرئيسية","content":"تُستخدم أداة التغذية الراجعة لجمع التغذية الراجعة من أصحاب المصلحة الداخليين أو الخارجيين للمشروع، مثل الجمهور والسكان المحليين وجيران المشروع وصانعي القرار وأصحاب المصلحة الآخرين.\r\n\r\nالوظائف\r\n\r\nزر التغذية الراجعة في شريط الأدوات الأيسر يفتح نموذج التغذية الراجعة العام بأسئلة\r\nأيقونات \"؟\" للتغذية الراجعة في العرض 3D تفتح نماذج تغذية راجعة مرتبطة بالموقع\r\nكل نموذج تغذية راجعة مختلف ويحدده فريق المشروع\r\nأجب عن أسئلة التغذية الراجعة واضغط زر الإرسال"},{"slug":"hide","title":"إخفاء","description":"إخفاء كائنات أو مناطق من مصادر البيانات.","category":"الأدوات الرئيسية","content":"تُستخدم أداة الإخفاء لإخفاء أجزاء من مصادر البيانات الموجودة على مستوى المشروع. مثلاً يمكنك إخفاء المباني المراد هدمها من تحت المباني الجديدة.\r\n\r\nإخفاء الكائنات\r\n\r\nتلوّن الأداة الكائنات التي يمكنك إخفاءها بألوان عشوائية\r\nحدد في العرض 3D الكائنات التي تريد إخفاءها. تتحول الكائنات المحددة إلى اللون الأحمر.\r\nحدد الكائنات الحمراء التي تريد إعادة إظهارها، أو استخدم زر \"إظهار الكل\".\r\nزر الحفظ يحفظ قائمة الكائنات المخفية\r\n\r\nإخفاء منطقة\r\n\r\nزر المنطقة يبدأ وظيفة رسم المنطقة\r\nارسم خطاً متعدداً حول المنطقة التي تريد إخفاءها\r\nأخيراً انقر بالزر الأيمن لإنهاء الرسم"},{"slug":"measurement","title":"القياس","description":"قياس النقاط والمسافات والأطوال والمساحات.","category":"الأدوات الرئيسية","content":"تُستخدم أداة القياس لأخذ وتحديد القياسات في العرض ثلاثي الأبعاد.\r\n\r\nأنواع القياس\r\n\r\nنقطة قياس إحداثيات نقطة واحدة\r\nمسافة قياس المسافة بين نقطتين\r\nطول قياس الطول الإجمالي لخط متعدد\r\nمساحة قياس مساحة منطقة خط متعدد\r\n\r\nالوظائف\r\n\r\nانقر في العرض 3D لتعيين نقاط القياس\r\nتُعرض نتائج القياس في الوقت الفعلي\r\nيمكن حفظ القياسات في المشروع"},{"slug":"navigation","title":"التنقل","description":"تنقل بسهولة باستخدام الماوس أو شاشات اللمس.","category":"الأساسيات","content":"بالماوس\r\n\r\nيتبع التنقل بالماوس أسلوب التنقل المألوف في تطبيقات الخرائط الشائعة:\r\n\r\nالزر الأيسر التحريك من مكان لآخر مع الحفاظ على نفس الارتفاع وزاوية الكاميرا\r\nالزر الأوسط التقريب / الإبعاد إما بالضغط على الزر وتحريك الماوس أو باستخدام عجلة الماوس\r\nالزر الأيمن الدوران حول الكائن تحت مؤشر الماوس أفقياً / عمودياً\r\n\r\nكل عمليات التنقل تأخذ الكائن تحت الماوس كنقطة مركز للتنقل. بالإشارة مثلاً إلى زاوية مبنى، يمكنك الدوران حول تلك الزاوية.\r\n\r\nعلى شاشات اللمس\r\n\r\nيتبع التنقل على شاشات اللمس أيضاً أسلوب التنقل المألوف:\r\n\r\nإصبع واحد التحريك بنفس طريقة الماوس\r\nالقرص بإصبعين التقريب أو الإبعاد بنفس طريقة الماوس\r\nالدوران بإصبعين الدوران بنفس طريقة الماوس"},{"slug":"organization-management","title":"إدارة المؤسسة","description":"إدارة المستخدمين والمشاريع والتراخيص ومساحة قاعدة البيانات والمكتبات على مستوى المؤسسة.","category":"الإدارة","content":"أداة إدارة المؤسسة متاحة فقط لمسؤولي المؤسسة وتُستخدم لإدارة مشاريع المؤسسة ومستخدميها وتراخيصها وحصص الاستخدام والمكتبات والسجلات على مستوى المؤسسة.\r\n\r\nالإعدادات\r\n\r\nتعديل المعلومات الأساسية للمؤسسة:\r\n\r\nالشعار يُعرض الشعار في الزاوية العليا اليمنى لجميع المشاريع. متاح فقط عند شراء ترخيص العلامة البيضاء الخاص.\r\nالاسم\r\nالعنوان\r\nعناوين البريد الإلكتروني يتم تعيين المستخدمين الجدد تلقائياً كمستخدمي مؤسسة إذا كان نطاق بريدهم الإلكتروني من النطاقات المدرجة هنا\r\n\r\nالمشاريع\r\n\r\nقائمة بجميع المشاريع المنشأة في هذه المؤسسة.\r\n\r\nإضافة مشروع جديد يضيف مشروعاً جديداً تحت المؤسسة\r\nتعديل تعديل إعدادات المشروع الأساسية دون فتح المشروع\r\nحذف حذف المشروع\r\n\r\nالمستخدمون\r\n\r\nقائمة بجميع المستخدمين المنشأين في هذه المؤسسة.\r\n\r\nالدور دور المستخدم في المؤسسة"},{"slug":"profile-settings","title":"إعدادات الملف الشخصي","description":"إدارة معلومات وإعدادات الملف الشخصي للمستخدم.","category":"الأساسيات","content":"تُستخدم إعدادات الملف الشخصي لتعديل ملف المستخدم:\r\n\r\nصورة الملف الشخصي – صورة المستخدم الشخصية. غير مستخدمة حالياً، محجوزة لميزات مستقبلية.\r\nاسم المستخدم – تغيير اسم المستخدم، وهو الاسم المعروض في العديد من الأدوات.\r\nالبريد الإلكتروني – تغيير عنوان البريد الإلكتروني. يتطلب بريداً إلكترونياً عاملاً، حيث يتم التحقق من العنوان الجديد قبل تفعيله.\r\nالاسم الأول واسم العائلة – الاسم الحقيقي للمستخدم\r\nاللغة – اللغة المستخدمة في واجهة المستخدم. 6DPlanner مترجم إلى عدة لغات. يؤثر إعداد اللغة أيضاً على كيفية عرض الأرقام والتواريخ والقيم الأخرى.\r\nحذف حسابي – حذف حساب المستخدم. كن حذراً عند استخدام هذا، فلا يمكن التراجع عنه. يتم إزالة المستخدمين نهائياً من النظام.\r\nتغيير كلمة المرور – تغيير كلمة مرور المستخدم."},{"slug":"project-list","title":"قائمة المشاريع","description":"إدارة مشاريع المستخدم وإنشاء مشاريع جديدة.","category":"الأساسيات","content":"تعرض قائمة المشاريع جميع المشاريع التي أنت عضو فيها. القائمة مقسمة إلى ثلاثة أقسام:\r\n\r\nمشاريعي – المشاريع التي أنشأتها\r\nالمشاريع المدعوّ إليها – المشاريع التي دعاك إليها مستخدمون آخرون\r\nقوالب المشاريع – قوالب المشاريع المستخدمة لإنشاء مشاريع جديدة\r\n\r\nكل مشروع يحتوي على أزرار لإدارة المشاريع:\r\n\r\nإعدادات المشروع – الوصول لإعدادات المشروع الأساسية مباشرة دون فتح المشروع\r\nمغادرة – مغادرة مشروع انضممت إليه بدعوة. ينطبق فقط على المشاريع المدعوّ إليها.\r\nنسخ المشروع – إنشاء نسخة من المشروع، مثلاً لإنشاء عدة نسخ من نفس المشروع\r\nحذف – حذف المشروع. المشاريع المحذوفة تُعلّم فقط كمحذوفة ويتم الاحتفاظ بالبيانات لمدة 30 يوماً تحسباً للحذف العرضي. إذا أردت استعادة مشروع، تواصل مع الدعم. بعد 30 يوماً لا يمكن استعادة المشروع المحذوف."},{"slug":"project-settings","title":"إعدادات المشروع","description":"إدارة المستخدمين والأدوار وبيانات الخصائص والمكتبات ونماذج التغذية الراجعة وسير العمل والإعدادات الأخرى على مستوى المشروع.","category":"الأساسيات","content":"تحدد إعدادات المشروع الإعدادات الخاصة بالمشروع للأدوات المختلفة.\r\n\r\nملاحظة: بعض الإعدادات متاحة فقط لأدوار مدير المشروع.\r\n\r\nالإعدادات العامة\r\n\r\nصورة المشروع\r\n\r\nتتيح صورة المشروع تعيين صورة مصغرة للمشروع في قائمة المشاريع. بشكل افتراضي، يتم إنشاؤها تلقائياً من أول عرض للمشروع.\r\n\r\nصورة البداية\r\n\r\nتتيح صورة البداية تعيين صورة مساعدة سريعة مخصصة تُعرض للمستخدمين عند فتح المشروع.\r\n\r\nاسم المشروع\r\n\r\nيظهر اسم المشروع في قائمة المشاريع وفي عنوان المتصفح كاسم صفحة الويب.\r\n\r\nنظام الإحداثيات\r\n\r\nنظام الإحداثيات النشط المستخدم مثلاً في وضع النموذج أو عرض الإحداثيات في أداة القياس."},{"slug":"queries","title":"الاستعلامات","description":"البحث عن كائنات النماذج حتى بمعايير بحث معقدة.","category":"الأدوات الرئيسية","content":"أداة الاستعلام هي بحث قاعدة بيانات متكامل وقوي يتيح البحث السريع عن كائنات BIM من بيانات المشروع الكبيرة.\r\n\r\nالوظائف\r\n\r\nجديد تحديد قاعدة استعلام جديدة\r\nحفظ حفظ قاعدة استعلام موجودة\r\nتنفيذ تنفيذ قاعدة الاستعلام المحددة النشطة\r\n\r\nمحرر القواعد\r\n\r\nاستخدم قواعد AND / OR / XOR لتحديد شروط متعددة\r\nاستخدم قاعدة \"المجلد\" لتقييد الاستعلامات بمجلد معين\r\nاستخدم قاعدة \"السمة\" للبحث بناءً على قيم السمات\r\nاستخدم قاعدة \"نوع البيانات\" لتقييد الاستعلامات بأنواع بيانات معينة\r\n\r\nنمط النتائج\r\n\r\nالنتيجة أنماط العرض للنتائج\r\nأخرى أنماط العرض للبيانات الأخرى\r\nاللون لون الكائنات\r\nالشفافية شفافية الكائنات\r\nالرؤية فرض إظهار / إخفاء النتائج\r\n\r\nنصائح\r\n\r\nاربط نتائج الاستعلام بمهام جدول 4D Gantt للجدولة على مستوى الكائنات. بهذه الطريقة تجد المهام دائماً الكائنات بناءً على قواعد الاستعلام، حتى عند تحديث النماذج."},{"slug":"release-notes","title":"ملاحظات الإصدار","description":"ملخص كل إصدار؛ الميزات الجديدة والتحسينات.","category":"الإدارة","content":"2026.01.2\r\n\r\nصدر في 30 يناير 2026\r\n\r\nالتحسينات\r\n\r\nرسوم متحركة لكاميرا نقاط المشاهدة\r\nتصدير صور نقاط المشاهدة\r\nأداة المواد للتصور التلقائي\r\nتصدير فيديو نقاط المشاهدة لرسوم الكاميرا المتحركة\r\nعرض البيانات الوصفية لـ KMZ / KML في ObjectInfo\r\nتحديث شريط أدوات نقاط المشاهدة\r\n\r\nالإصلاحات\r\n\r\nمشاكل حفظ وتحميل الحسابات\r\nبعض النماذج لم تُعرض بشكل صحيح بعد الاستيراد\r\nاستيراد MS Project في 4DGantt بشكل صحيح تحت المهمة الفرعية المحددة\r\nالمشاريع لم تظهر دائماً في قائمة مشاريع المؤسسة\r\nتحسينات تسجيل الدخول عبر AzureAD"},{"slug":"sketch-models","title":"نماذج المخططات","description":"ارسم بسرعة وسهولة كائنات 3D وخطوط ومساحات ونماذج حجمية لاستخدامات متنوعة.","category":"الأدوات الرئيسية","content":"أداة نموذج المخطط هي أداة نمذجة ذكية وقوية. تُستخدم لنمذجة مخططات بسيطة وسريعة.\r\n\r\nعنصر\r\n\r\nأضف عناصر فردية بالموقع والنصف القطر. اختر نموذج 3D من المكتبة لوضع كائنات 3D في المشروع.\r\n\r\nمناسب مثلاً لخطط تنسيق المواقع والأثاث الحضري ونمذجة آلات موقع البناء.\r\n\r\nخط\r\n\r\nأضف عناصر خطوط متعددة بنقاط خط وعرض وارتفاع. عندما الارتفاع = 0، يتبع الخط جميع النماذج والأرض تحت الخط.\r\n\r\nمناسب مثلاً لرسم الطرق والمسارات والأسوار أو خنادق موقع البناء.\r\n\r\nمساحة\r\n\r\nأضف مساحات بنقاط زوايا وارتفاع. عندما الارتفاع = 0، تتبع المساحة سطح الأرض.\r\n\r\nمناسب مثلاً لرسم كتل المباني ومناطق الوقوف أو مناطق الحدائق.\r\n\r\nحجم\r\n\r\nأضف نماذج حجمية بنقاط زوايا وارتفاع.\r\n\r\nمناسب مثلاً لنمذجة كتل التربة والحفريات أو الردم."},{"slug":"snapshot","title":"لوحة الحالة","description":"رؤية حالة المشروع بسرعة من خلال لوحة بصرية موحدة.","category":"الأدوات الرئيسية","content":"تُستخدم أداة لوحة الحالة لتلخيص حالة المشروع في تقرير حالة من صفحة واحدة بعدة عروض تحليلية.\r\n\r\nالوظائف\r\n\r\nمنتقي النطاق الزمني اختر النطاق الزمني الذي يُجمع له تقرير الحالة\r\nدائرة وجدول المواضيع يعرض ملخص المواضيع كرسم بياني دائري وجدول\r\nالسرعة تحليل مدى سرعة تقدم أو إغلاق المواضيع\r\nالمواضيع النشطة رسم بياني لتاريخ تقدم المواضيع\r\nاكتمال المشروع يعرض مدى اكتمال المشروع بناءً على حالات المواضيع\r\n\r\nنصائح\r\n\r\nاستخدم لوحة الحالة التلقائية هذه لإيصال حالة المشروع لأصحاب المصلحة."},{"slug":"system-settings","title":"إعدادات النظام","description":"إدارة الإعدادات العامة التي تؤثر على سلوك الأداة.","category":"الأساسيات","content":"تُغيّر إعدادات النظام سلوك التطبيق.\r\n\r\nعام\r\n\r\nيمكن تشغيل/إيقاف الإعدادات التالية بسرعة:\r\n\r\nالكرة الأرضية نموذج التضاريس العالمي وخرائط الخلفية. عند الإيقاف، يخفي التضاريس وخرائط الخلفية.\r\nمستوى المشروع مستوى المشروع الافتراضي، إذا تم ضبط الاستيراد لاستخدام وضع \"Plane\"\r\nتنعيم الحواف تنعيم الحواف\r\nالظلال الظلال من ضوء الشمس\r\nHUD عرض معلومات سرعة التصيير، مثل fps\r\nتوفير البطارية لا يتم تحديث الشاشة عندما لا تحدث تغييرات في العرض ثلاثي الأبعاد\r\nالإضاءة المحيطة تأثير الإضاءة المحيطة الذي يحاكي انعكاس الضوء عن الأسطح\r\nأداة الفحص أداة خاصة لفحص كائنات النموذج\r\nالحجم المحيط يعرض أحجام بيانات النموذج المحددة\r\n\r\nالإعدادات\r\n\r\nيمكن ضبط الإعدادات التالية بدقة:\r\n\r\nلون الخلفية ضبط لون الخلفية المرئي عند إيقاف الكرة الأرضية"},{"slug":"technical-documentation","title":"التوثيق التقني","description":"التوثيق التقني لإدارة تقنية المعلومات في المؤسسة.","category":"الإدارة","content":"البنية المعمارية\r\n\r\nتم تنفيذ 6DPlanner على بنية وبنية تحتية سحابية من AWS (Amazon Web Services). توجد الخوادم والبيانات في مراكز بيانات AWS القريبة من المستخدمين، حسب منطقة المستخدم.\r\n\r\nتعتمد الخدمة على بنية سحابية \"بدون خادم\" حديثة، حيث تُبدأ العمليات حسب الحاجة بشكل متوازٍ، مما يتيح نظرياً قابلية توسع غير محدودة بناءً على احتياجات الاستخدام.\r\n\r\nتم تحقيق تجربة مستخدم عالية الأداء على أجهزة العملاء باستخدام تقنية بث الويب CesiumJS الذكية متعددة الدقة على مستوى الكائنات، والتي تتيح التحميل الديناميكي للبيانات بناءً على موقع المشاهد."},{"slug":"timeline","title":"الخط الزمني","description":"ضبط الوقت ورؤية المشروع في ظروف إضاءة مختلفة.","category":"الأدوات الرئيسية","content":"تُستخدم أداة الخط الزمني لتغيير الوقت الحالي للمشروع، ويمكن استخدامها مثلاً لتحليل الظلال.\r\n\r\nالوظائف\r\n\r\nتعيين الوقت الدقيق بمنتقي التاريخ والوقت\r\nضبط الوقت النشط بأزرار التقديم / الرجوع\r\nتحريك الوقت بالماوس على شريط تمرير الخط الزمني\r\nتشغيل الرسوم المتحركة للخط الزمني بزر التشغيل\r\nضبط مقياس الوقت النشط: ساعة / يوم / أسبوع / شهر / سنة\r\n\r\nنصائح\r\n\r\nإجراء تحليل ظلال الشمس بالخط الزمني:\r\n1. تفعيل الظلال في إعدادات النظام\r\n2. تعيين وقت البدء النشط بدقة في منتقي الوقت\r\n3. تعيين مقياس الوقت للساعات\r\n4. تحريك شريط تمرير الخط الزمني من اليسار إلى اليمين لمحاكاة ظلال أشعة الشمس في أوقات مختلفة\r\n5. يمكنك أيضاً تشغيل الرسوم المتحركة لتحليل الظلال بزر التشغيل"},{"slug":"topic-list","title":"قائمة المواضيع","description":"البحث والتصفية في جميع مواضيع المشروع.","category":"الأدوات الرئيسية","content":"تُستخدم أداة قائمة المواضيع لإدارة أعداد كبيرة من المواضيع بسهولة باستخدام أدوات الترتيب والتصفية.\r\n\r\nالوظائف\r\n\r\nالترتيب انقر على رأس العمود لترتيب المحتوى\r\nالتصفية انقر على أيقونة الفلتر في رأس العمود لتحديد قاعدة تصفية\r\nالتصفية السريعة انقر على قيمة خلية لتصفية تلك القيم فقط\r\nالتحديد حدد مواضيع باستخدام مربع الاختيار على الجانب الأيسر من الجدول\r\nالحذف احذف المواضيع المحددة بزر الحذف\r\nجديد إنشاء مواضيع جديدة\r\n\r\nملاحظة: إذا كان هناك عدد كبير من المواضيع، فإنها تُعرض على عدة صفحات. يمكنك التبديل بين الصفحات من أداة الصفحات في الزاوية السفلية اليمنى.\r\n\r\nنصائح\r\n\r\nانقر على اسمك في حقل الشخص لعرض المواضيع المعينة لك بسرعة"},{"slug":"topic-report","title":"تقرير المواضيع","description":"تجميع جميع مواضيع المشروع في جدول واحد وتصديرها إلى Excel للتحليل المفصل.","category":"الأدوات الرئيسية","content":"تُستخدم أداة تقرير المواضيع للإبلاغ عن جميع مواضيع المشروع وتلخيصها في جدول سهل القراءة.\r\n\r\nالوظائف\r\n\r\nتصفح المواضيع باستخدام الجدول مع شريط التمرير\r\nأعمدة العناوين تعرض ملخص المواضيع\r\nإذا كانت المواضيع تحتوي على سير عمل، فلكل سير عمل جدول منفصل\r\nتصدير تصدير تقرير المواضيع إلى Excel للاستخدام الإضافي\r\n\r\nنصائح\r\n\r\nاستخدم تقرير المواضيع للإبلاغ عن حالة المشروع للعملاء النهائيين. يعرض التقرير كل موضوع في المشروع وحالته وخطوات سير العمل. يتم إنشاؤه تلقائياً ويوفر وقتك."},{"slug":"topics","title":"المواضيع","description":"إدارة الأهداف والمتطلبات والمهام والمخاطر والأفكار والمشكلات المرتبطة بالموقع والبيانات.","category":"الأدوات الرئيسية","content":"أداة المواضيع هي أداة تعاون قوية لإدارة مواضيع المشروع المختلفة مثل المهام والمشكلات والمخاطر والمتطلبات والتعليقات والملاحظات.\r\n\r\nمحرر المواضيع\r\n\r\nالإضافة والتعديل\r\n\r\nأضف موضوعاً جديداً باستخدام زر إضافة موضوع في شريط الأدوات الأيمن\r\nافتح موضوعاً موجوداً بالنقر على أيقونة الموضوع في العرض 3D\r\n\r\nلوحة التعديل\r\n\r\nالمعلومات الأساسية:\r\nالاسم اسم الموضوع، يُعرض في العرض 3D فوق أيقونة الموضوع\r\nالوصف وصف الموضوع كنص متعدد الأسطر\r\nالنوع إشعار / تعليق / فكرة / مهمة / مشكلة / خطر / متطلب\r\nالأولوية منخفضة / عادية / عالية / حرجة\r\nالحالة حالة بنمط كانبان للموضوع\r\nالعلامات أضف علاماتك الخاصة إلى المواضيع\r\n\r\nمعلومات إضافية:\r\nنقاط المشاهدة يمكن أن يكون للمواضيع عدة نقاط مشاهدة\r\nالكائنات قائمة الكائنات المرتبطة بالموضوع\r\n\r\nسير العمل:\r\nسير العمل هي عمليات محددة مسبقاً بخطوات، كل خطوة لها مسؤولوها وقوائم تحققها.\r\n\r\nالإجراءات:\r\nنقطة مشاهدة حفظ نقاط مشاهدة للموضوع\r\nالموقع تعيين موقع الموضوع في 3D\r\nالربط بالكائنات تحديد وربط كائنات بالموضوع\r\nحفظ / إلغاء"},{"slug":"viewpoints","title":"نقاط المشاهدة","description":"حفظ نقاط المشاهدة وإنشاء عروض تقديمية من مواقف وسيناريوهات مختلفة.","category":"الأدوات الرئيسية","content":"أداة نقاط المشاهدة هي أداة عرض تقديمي قوية تحل محل أدوات العرض المنفصلة مثل PowerPoint. تُستخدم لحفظ عروض محددة مسبقاً.\r\n\r\nالوظائف\r\n\r\nانقر على نقطة مشاهدة لتفعيلها\r\nانقر على أيقونة التحديث لتحديث نقطة المشاهدة\r\nانقر على أيقونة الحذف لحذف نقطة المشاهدة\r\nانقر مرتين على اسم نقطة المشاهدة لتعديلها\r\n\r\nنقاط المشاهدة تحفظ وتحمّل الإعدادات التالية:\r\n\r\nعرض الكاميرا\r\nوقت الخط الزمني\r\nرؤية مصادر البيانات والقطع\r\nإعدادات التصيير مثل الظلال\r\n\r\nنصائح\r\n\r\nأنشئ عروضاً تقديمية تفاعلية بنقاط المشاهدة، مثل عرض شرائح PowerPoint\r\nشارك العروض التقديمية بمشاركة رابط المشروع مع المشاهدين"}]