[{"slug":"4d-gantt","title":"4D Gantt","description":"Erstellen Sie Zeitpläne, verknüpfen Sie Aufgaben mit Projektobjekten und visualisieren Sie Zeitpläne als 4D-Simulation.","category":"Hauptwerkzeuge","content":"4D Gantt ist ein leistungsstarkes Planungswerkzeug, das separate Planungswerkzeuge wie MS Project oder Primavera ersetzt.\r\n\r\nSymbolleiste\r\n\r\nImport Zeitplan aus MS Project, Primavera und IFC-Formaten importieren\r\nExport Zeitplan in MS Project, Primavera, PDF, PNG, Excel oder iCal exportieren\r\nAls Baseline setzen Speichert den aktuellen Zeitplan als Baseline zum Vergleich\r\nRückgängig / Wiederherstellen Änderungen rückgängig machen oder wiederherstellen\r\n\r\nAufgaben\r\n\r\nAufgaben mit der Plus-Schaltfläche hinzufügen\r\nAufgabenname, Startund Enddatum, Dauer und Fortschritt bearbeiten\r\nHierarchische Struktur: Aufgaben können Unteraufgaben enthalten\r\nAufgaben mit Abhängigkeiten verknüpfen (FS, FF, SS, SF)\r\n\r\n4D-Simulation\r\n\r\nVerknüpfen Sie Aufgaben mit Modellobjekten und visualisieren Sie den Zeitplan als 4D-Simulation. Mit dem Zeitleisten-Werkzeug können Sie die Animation abspielen und den Projektfortschritt über die Zeit sehen."},{"slug":"abfragen","title":"Abfragen","description":"Modellobjekte auch mit komplexen Suchkriterien finden.","category":"Hauptwerkzeuge","content":"Das Abfrage-Werkzeug ist eine leistungsstarke integrierte Datenbanksuche, die das schnelle Finden von BIM-Objekten aus großen Projektdaten ermöglicht.\r\n\r\nFunktionalität\r\n\r\nNeu Neue Abfrageregel definieren\r\nSpeichern Bestehende Abfrageregel speichern\r\nAusführen Ausgewählte Abfrageregel ausführen\r\n\r\nRegeleditor\r\n\r\nAND / OR / XOR-Regeln für mehrere Bedingungen verwenden\r\n\"Ordner\"-Regel zum Einschränken auf bestimmte Ordner\r\n\"Attribut\"-Regel zum Suchen nach Attributwerten\r\n\"Datentyp\"-Regel zum Einschränken auf bestimmte Datentypen\r\n\r\nErgebnisstil\r\n\r\nErgebnis Darstellungsstile für Ergebnisse\r\nAndere Darstellungsstile für andere Daten\r\nFarbe Objektfarbe\r\nTransparenz Objekttransparenz\r\nSichtbarkeit Ergebnisse erzwungen sichtbar / ausgeblendet\r\n\r\nTipps\r\n\r\nVerknüpfen Sie Abfrageergebnisse mit 4D Gantt-Zeitplanaufgaben für Planung auf Objektebene. So finden Aufgaben immer Objekte basierend auf Abfrageregeln, auch wenn Modelle aktualisiert werden."},{"slug":"ansichtspunkte","title":"Ansichtspunkte","description":"Speichern Sie Ansichtspunkte und erstellen Sie Präsentationen aus verschiedenen Szenarien.","category":"Hauptwerkzeuge","content":"Das Ansichtspunkte-Werkzeug ist ein leistungsstarkes Präsentationswerkzeug, das PowerPoint ersetzt.\r\n\r\nFunktionalität\r\n\r\nKlicken Sie auf einen Ansichtspunkt, um ihn zu aktivieren\r\nKlicken Sie auf das Aktualisieren-Symbol zum Aktualisieren\r\nKlicken Sie auf das Löschen-Symbol zum Löschen\r\nDoppelklicken Sie auf den Namen zum Bearbeiten\r\n\r\nAnsichtspunkte speichern und laden folgende Einstellungen:\r\n\r\nKameraansicht\r\nZeitleistenzeit\r\nSichtbarkeit und Schnitt der Datenquellen\r\nRendereinstellungen wie Schatten\r\n\r\nTipps\r\n\r\nErstellen Sie interaktive Präsentationen mit Ansichtspunkten\r\nTeilen Sie Präsentationen über den Projektlink"},{"slug":"anzeigemodi","title":"Anzeigemodi","description":"Wechseln Sie zwischen 2D-, 3D-, GPS-, Vollbild- und VR-Modus.","category":"Grundlagen","content":"Das Werkzeug verfügt über folgende Anzeigemodi:\r\n\r\n3D – Standardmodus, der die Ansicht in der 3D-Perspektive darstellt\r\n2D – Isometrische Draufsicht, auch als \"Kartenansicht\" bekannt. Entfernt die Perspektivansicht.\r\nGPS – Aktiviert die GPS-Positionierung des Geräts und zoomt auf den Gerätestandort. Der GPS-Modus verfügt auch über einen Kompassmodus, der die Ansicht des Benutzers nach den Kompasspunkten des Geräts dreht.\r\nVR – Aktiviert den Dual-Rendering-Modus, der ein für beide Augen gerendertes Bild anzeigt. Kann mit VR-Headsets verwendet werden, die solche Visualisierungsmodi unterstützen."},{"slug":"ausblenden","title":"Ausblenden","description":"Objekte oder Bereiche aus Datenquellen ausblenden.","category":"Hauptwerkzeuge","content":"Das Ausblenden-Werkzeug wird verwendet, um Teile bestehender Datenquellen auf Projektebene auszublenden.\r\n\r\nObjekte ausblenden\r\n\r\nDas Werkzeug färbt Objekte mit zufälligen Farben ein\r\nWählen Sie in der 3D-Ansicht die Objekte aus, die Sie ausblenden möchten. Ausgewählte Objekte werden rot.\r\nWählen Sie rote Objekte, die wieder sichtbar werden sollen, oder verwenden Sie \"Alle anzeigen\".\r\nDie Schaltfläche Speichern speichert die Liste der ausgeblendeten Objekte\r\n\r\nBereich ausblenden\r\n\r\nDie Bereich-Schaltfläche startet die Bereichszeichnungsfunktion\r\nZeichnen Sie eine Polylinie um den auszublendenden Bereich\r\nBeenden Sie mit einem Rechtsklick"},{"slug":"berechnungen","title":"Berechnungen","description":"Projekt- oder Modellmengen auch auf Objektebene summieren.","category":"Hauptwerkzeuge","content":"Das Berechnungs-Werkzeug ist eine leistungsstarke Tabellenkalkulation, die Berechnungen basierend auf Metadaten von Datenmodellobjekten ermöglicht.\r\n\r\nFunktionalität\r\n\r\nNeu Neue Berechnung erstellen\r\nName Berechnungsname\r\nEbene Berechnung basiert auf Dateioder Objektattributen\r\nSpeichern Aktuelle Berechnung speichern\r\nExport Aktuelle Berechnung im Excel-Format exportieren\r\n\r\nTabellenkalkulation\r\n\r\nDaten Inhalt für die erste Spalte wählen\r\n  Ordner Nach Datenbaum-Ordnern trennen\r\n  Attribut Nach Objektattributwerten trennen\r\nSpalte Berechnungsinhalt für Spalten wählen\r\n  Zusammenfassung Gesamtsumme ausgewählter Attributwerte berechnen\r\n  Menge Anzahl der Objekte zählen\r\n\r\nZellregeln\r\n\r\nTabellenkalkulationszellen können beliebige Formeln enthalten. Fast alle Formeln wie in Excel werden unterstützt.\r\n\r\nTipps\r\n\r\nSchnelle Kostenberechnung erstellen: Daten: Attribut \"Material\" Spalte: Attribut \"Volumen\" wählen. Spalten \"Stückpreis\" und \"Gesamtpreis\" mit eigenen Formeln hinzufügen."},{"slug":"datenverwaltung","title":"Datenverwaltung","description":"Projektdatenquellen hinzufügen, bearbeiten und organisieren.","category":"Hauptwerkzeuge","content":"Das Datenverwaltungs-Werkzeug wird zur Verwaltung aller Projektdatenquellen verwendet, um sie in Ordner zu organisieren, Zugriffsrechte zu verwalten und zu steuern, wie Daten in 3D-Ansichten erscheinen.\r\n\r\nSymbolleiste\r\n\r\nDaten hinzufügen Öffnet einen Dialog mit Registerkarten für verschiedene Datentypen\r\nOrdner hinzufügen Fügt einen neuen Ordner unter dem aktuell ausgewählten Ordner hinzu\r\nDaten aktualisieren Laden Sie eine neue Version einer Modelldatei hoch\r\nHerunterladen Laden Sie die ausgewählte Datendatei herunter\r\nDateneinstellungen Einstellungen der ausgewählten Datenquelle anpassen\r\nUmbenennen Datenquelle mit neuem Namen umbenennen\r\nAusblenden Datenquelle sichtbar machen / ausblenden\r\nAuf Daten zoomen Aktuelle Ansicht auf die Datenquelle verschieben\r\nNeu importieren Ausgewählte Datenquelle neu importieren\r\nLöschen Ausgewählte Daten löschen"},{"slug":"feedback-bericht","title":"Feedback-Bericht","description":"Alle Feedbacks in einer Tabelle zusammenfassen und als Excel exportieren.","category":"Hauptwerkzeuge","content":"Der Feedback-Bericht fasst alle Feedbacks in einer Tabelle zusammen.\r\n\r\nFunktionalität\r\n\r\nFeedback-Antworten in der Tabelle durchblättern\r\nFeedback-Tabelle als Excel-Datei exportieren\r\nEmoji-Antworten werden als Zahlen gespeichert (Standard: 0 = sehr glücklich, 4 = sehr unglücklich)\r\n\r\nTipps\r\n\r\nFeedback-Statistiken in Excel berechnen (Mittelwert, Median usw.)\r\nFeedback mit KI analysieren"},{"slug":"feedback","title":"Feedback","description":"Strukturiertes Feedback mit anpassbaren Feedback-Formularen geben.","category":"Hauptwerkzeuge","content":"Das Feedback-Werkzeug sammelt Feedback von internen oder externen Stakeholdern wie der Öffentlichkeit, Anwohnern, Entscheidungsträgern und anderen Beteiligten.\r\n\r\nFunktionalität\r\n\r\nDie Feedback-Schaltfläche in der linken Symbolleiste öffnet das allgemeine Feedback-Formular\r\nFeedback-\"?\"-Symbole in der 3D-Ansicht öffnen standortbezogene Feedback-Formulare\r\nJedes Feedback-Formular ist individuell vom Projektteam definiert\r\nBeantworten Sie die Fragen und drücken Sie die Absenden-Schaltfläche"},{"slug":"messung","title":"Messung","description":"Punkte, Abstände, Längen und Flächen messen.","category":"Hauptwerkzeuge","content":"Das Messwerkzeug wird zur Durchführung und Markierung von Messungen in der 3D-Ansicht verwendet.\r\n\r\nMesstypen\r\n\r\nPunkt Koordinaten eines einzelnen Punktes messen\r\nAbstand Abstand zwischen zwei Punkten messen\r\nLänge Gesamtlänge einer Polylinie messen\r\nFläche Fläche eines Polylinienbereichs messen\r\n\r\nFunktionalität\r\n\r\nKlicken Sie in der 3D-Ansicht, um Messpunkte zu setzen\r\nMessergebnisse werden in Echtzeit angezeigt\r\nMessungen können im Projekt gespeichert werden"},{"slug":"momentaufnahme","title":"Momentaufnahme","description":"Projektstatus schnell über ein konsolidiertes visuelles Dashboard einsehen.","category":"Hauptwerkzeuge","content":"Das Momentaufnahme-Werkzeug fasst den Projektstatus in einem einseitigen Statusbericht mit mehreren analytischen Ansichten zusammen.\r\n\r\nFunktionalität\r\n\r\nZeitraumauswahl Zeitraum für den Statusbericht wählen\r\nThemen-Kreisdiagramm und Tabelle Zusammenfassung der Themen als Kreisund Tabellendiagramm\r\nGeschwindigkeit Analyse der Themenbearbeitungsgeschwindigkeit\r\nAktive Themen Diagramm des Themenfortschrittsverlaufs\r\nProjektfertigstellung Projektfertigstellungsgrad basierend auf Themenstatus\r\n\r\nTipps\r\n\r\nVerwenden Sie dieses automatische Dashboard zur Kommunikation des Projektstatus an Stakeholder."},{"slug":"navigation","title":"Navigation","description":"Navigieren Sie einfach mit der Maus oder Touchscreens.","category":"Grundlagen","content":"Maus\r\n\r\nDie Mausnavigation folgt der bekannten Navigation gängiger Kartenanwendungen:\r\n\r\nLinke Taste Von Ort zu Ort schwenken, wobei Höhe und Kamerawinkel beibehalten werden\r\nMittlere Taste Hinein-/Herauszoomen durch Drücken der Taste und Bewegen der Maus oder mit dem Mausrad\r\nRechte Taste Um das Objekt unter dem Mauszeiger horizontal / vertikal drehen\r\n\r\nAlle Navigationsaktionen nehmen das Objekt unter der Maus als Mittelpunkt der Navigation. Wenn Sie z.B. auf eine Gebäudeecke zeigen, können Sie um diese Ecke drehen.\r\n\r\nTouchscreens\r\n\r\nDie Touchscreen-Navigation folgt ebenfalls der bekannten Navigation gängiger Kartenanwendungen:\r\n\r\nEin Finger Schwenken wie mit der Maus\r\nZwei Finger zusammenziehen Hineinoder herauszoomen wie mit der Maus\r\nZwei Finger drehen Drehen wie mit der Maus"},{"slug":"organisationsverwaltung","title":"Organisationsverwaltung","description":"Verwalten Sie Benutzer, Projekte, Lizenzen, Datenbankspeicher und Bibliotheken auf Organisationsebene.","category":"Verwaltung","content":"Das Organisationsverwaltungswerkzeug ist nur für Organisationsadministratoren verfügbar und dient der Verwaltung von Projekten, Benutzern, Lizenzen, Nutzungskontingenten sowie Bibliotheken und Protokollen auf Organisationsebene.\r\n\r\nEinstellungen\r\n\r\nBearbeiten Sie die Grundinformationen der Organisation:\r\n\r\nLogo Das Logo wird in der oberen rechten Ecke aller Projekte angezeigt. Nur verfügbar bei Erwerb einer speziellen Whitelabel-Lizenz.\r\nName\r\nAdresse\r\nE-Mail-Adressen Neue Benutzer werden automatisch als Organisationsbenutzer zugewiesen, wenn die E-Mail-Domain des Benutzers eine der hier aufgelisteten Domains ist\r\n\r\nProjekte\r\n\r\nListe aller in dieser Organisation erstellten Projekte.\r\n\r\nNeues Projekt hinzufügen Fügt ein neues Projekt unter der Organisation hin\r\nBearbeiten Grundeinstellungen des Projekts bearbeiten ohne es zu öffnen\r\nLöschen Löscht das Projekt\r\n\r\nBenutzer\r\n\r\nListe aller in dieser Organisation erstellten Benutzer.\r\n\r\nRolle Die Rolle des Benutzers in der Organisation"},{"slug":"profileinstellungen","title":"Profileinstellungen","description":"Verwalten Sie Benutzerprofilinformationen und -einstellungen.","category":"Grundlagen","content":"Profileinstellungen werden zur Bearbeitung des Benutzerprofils verwendet:\r\n\r\nProfilbild – Persönliches Bild des Benutzers. Derzeit nicht in Verwendung, reserviert für zukünftige Funktionen.\r\nBenutzername – Ändern Sie den Benutzernamen, der als Anzeigename in vielen Werkzeugen dient.\r\nE-Mail – Ändern Sie die E-Mail-Adresse. Dies erfordert eine funktionierende E-Mail, da die neue Adresse vor der Aktivierung verifiziert wird.\r\nVorund Nachname – Echter Name des Benutzers\r\nSprache – Sprache der Benutzeroberfläche. 6DPlanner ist in mehrere Sprachen übersetzt. Die Spracheinstellung beeinflusst auch die Darstellung von Zahlen, Daten und anderen Werten.\r\nMein Konto löschen – Löscht das Benutzerkonto. Seien Sie vorsichtig, dies kann nicht rückgängig gemacht werden.\r\nPasswort ändern – Ändern Sie das Benutzerpasswort."},{"slug":"projekteinstellungen","title":"Projekteinstellungen","description":"Verwalten Sie Benutzer, Rollen, Eigenschaftsdaten, Bibliotheken, Feedback-Formulare, Workflows und andere Einstellungen auf Projektebene.","category":"Grundlagen","content":"Projekteinstellungen definieren projektspezifische Einstellungen für verschiedene Werkzeuge.\r\n\r\nHinweis: Einige Einstellungen sind nur für Projektmanager-Benutzerrollen verfügbar.\r\n\r\nAllgemeine Einstellungen\r\n\r\nProjektbild\r\n\r\nDas Projektbild ermöglicht das Festlegen eines Miniaturbilds für das Projekt. Standardmäßig wird es automatisch aus der ersten Ansicht erstellt.\r\n\r\nStartbild\r\n\r\nDas Startbild ermöglicht das Festlegen eines benutzerdefinierten Schnellhilfebilds, das Benutzern beim Öffnen des Projekts angezeigt wird.\r\n\r\nProjektname\r\n\r\nDer Projektname wird in der Projektliste und im Browsertitel als Webseitenname angezeigt.\r\n\r\nKoordinatensystem\r\n\r\nDas aktive Koordinatensystem, das z.B. bei der Modellplatzierung oder der Anzeige von Koordinaten im Messwerkzeug verwendet wird."},{"slug":"projektliste","title":"Projektliste","description":"Verwalten Sie Benutzerprojekte und erstellen Sie neue Projekte.","category":"Grundlagen","content":"Die Projektliste zeigt alle Projekte, in denen Sie Mitglied sind. Die Liste ist in drei Abschnitte unterteilt:\r\n\r\nMeine Projekte – von Ihnen erstellte Projekte\r\nEingeladene Projekte – Projekte, zu denen andere Benutzer Sie eingeladen haben\r\nProjektvorlagen – Projektvorlagen zum Erstellen neuer Projekte\r\n\r\nJedes Projekt verfügt über Schaltflächen zur Projektverwaltung:\r\n\r\nProjekteinstellungen – Zugriff auf grundlegende Projekteinstellungen direkt ohne das Projekt zu öffnen\r\nVerlassen – Ein Projekt verlassen, dem Sie per Einladung beigetreten sind\r\nProjekt klonen – Eine Kopie des Projekts erstellen\r\nLöschen – Löscht das Projekt. Gelöschte Projekte werden nur als gelöscht markiert und die Daten werden 30 Tage lang aufbewahrt. Kontaktieren Sie den Support zur Wiederherstellung. Nach 30 Tagen kann ein gelöschtes Projekt nicht mehr wiederhergestellt werden."},{"slug":"schnittebene","title":"Schnittebene","description":"Modelle horizontal, vertikal oder entlang einer Straßenachse schneiden.","category":"Hauptwerkzeuge","content":"Mit dem Werkzeug Schnittebene können Modelle aufgeschnitten und Querschnittsansichten erstellt werden.\r\n\r\nHorizontal\r\n\r\nDie horizontale Schnittebene schneidet Modelle horizontal. Nützlich z.B. zur Untersuchung von Gebäudegrundrissen.\r\n\r\nVertikal\r\n\r\nDie vertikale Schnittebene schneidet Modelle vertikal entlang einer geraden Linie zwischen zwei Punkten. Nützlich z.B. zur Untersuchung von Gebäudestrukturen.\r\n\r\nEntlang der Straßenachse\r\n\r\nDie Straßenachsen-Schnittebene schneidet Modelle ähnlich wie der vertikale Schnitt, aber senkrecht zur und entlang der Straßenachse. Die Position kann über die Stationierung angepasst werden."},{"slug":"skizzenmodelle","title":"Skizzenmodelle","description":"Skizzieren Sie schnell und einfach 3D-Objekte, Linien, Flächen und Volumenmodelle.","category":"Hauptwerkzeuge","content":"Das Skizzenmodell-Werkzeug ist ein leistungsstarkes intelligentes Modellierungswerkzeug für schnelle einfache Skizzenmodelle.\r\n\r\nElement\r\n\r\nFügen Sie einzelne Elemente mit Position und Radius hinzu. Wählen Sie ein 3D-Modell aus der Bibliothek.\r\n\r\nGeeignet z.B. für Landschaftsplanung, Stadtmobiliar und Baustellenmaschinen.\r\n\r\nLinie\r\n\r\nFügen Sie Polylinien-Element mit Linienpunkten, Breite und Höhe hinzu. Bei Höhe = 0 folgt die Linie allen Modellen und dem Boden.\r\n\r\nGeeignet z.B. für Straßen, Gleise, Zäune oder Baustellengräben.\r\n\r\nFläche\r\n\r\nFügen Sie Polylinien-Flächen mit Eckpunkten und Höhe hinzu. Bei Höhe = 0 folgt die Fläche der Bodenoberfläche.\r\n\r\nGeeignet z.B. für Gebäudemassen, Parkflächen oder Parkgebiete.\r\n\r\nVolumen\r\n\r\nFügen Sie Volumenmodelle mit Eckpunkten und Höhe hinzu.\r\n\r\nGeeignet z.B. für Erdmassen, Aushubmengen oder Aufschüttungen."},{"slug":"systemeinstellungen","title":"Systemeinstellungen","description":"Verwalten Sie allgemeine Einstellungen, die das Werkzeugverhalten beeinflussen.","category":"Grundlagen","content":"Systemeinstellungen ändern das Verhalten der Anwendung.\r\n\r\nAllgemein\r\n\r\nFolgende Einstellungen können schnell ein-/ausgeschaltet werden:\r\n\r\nGlobus Globales Geländemodell und Hintergrundkarten. Bei Deaktivierung werden Gelände und Hintergrundkarten ausgeblendet.\r\nProjektebene Virtuelle Projektebene, wenn der Import auf den \"Plane\"-Modus (Projektebene) eingestellt ist\r\nKantenglättung Kantenglättung\r\nSchatten Schatten durch Sonnenlicht\r\nHUD (Heads-Up-Display) Informationsanzeige zur Rendergeschwindigkeit, wie fps\r\nBatterie sparen Anzeige wird nicht aktualisiert, wenn keine Änderungen in der 3D-Ansicht auftreten\r\nUmgebungsverdeckung Umgebungsverdeckungseffekt, der das Abprallen von Licht von Oberflächen simuliert\r\nInspektionswerkzeug Spezielles Werkzeug zur Inspektion von Modellobjekten\r\nBegrenzungsvolumen Zeigt die Volumina der ausgewählten Modelldaten\r\n\r\nEinstellungen\r\n\r\nFolgende Einstellungen können fein justiert werden:\r\n\r\nHintergrundfarbe Passen Sie die Hintergrundfarbe an, die sichtbar ist, wenn der Globus deaktiviert ist"},{"slug":"technische-dokumentation","title":"Technische Dokumentation","description":"Technische Dokumentation für die IT-Verwaltung der Organisation.","category":"Verwaltung","content":"Architektur\r\n\r\n6DPlanner ist auf der AWS (Amazon Web Services) Cloud-Architektur und -Infrastruktur implementiert. Die Server und Daten befinden sich in AWS-Rechenzentren in der Nähe der Benutzer, abhängig von der Region des Benutzers.\r\n\r\nDer Dienst basiert auf einer modernen \"serverlosen\" Cloud-Architektur, bei der Prozesse nach Bedarf parallel gestartet werden, was theoretisch unbegrenzte Skalierbarkeit basierend auf Nutzungsanforderungen ermöglicht.\r\n\r\nDie leistungsstarke Benutzererfahrung auf Client-Geräten wurde mit der einzigartigen intelligenten Multi-Resolution-Objektebene-Web-Streaming CesiumJS-Technologie implementiert, die das dynamische Laden von Daten basierend auf dem Standort des Betrachters ermöglicht."},{"slug":"themen","title":"Themen","description":"Ziele, Anforderungen, Aufgaben, Risiken, Ideen, Probleme standort- und datenverknüpft verwalten.","category":"Hauptwerkzeuge","content":"Das Themen-Werkzeug ist ein leistungsstarkes Kollaborationswerkzeug zur Verwaltung verschiedener Projektthemen wie Aufgaben, Probleme, Risiken, Anforderungen, Kommentare, Notizen.\r\n\r\nThemeneditor\r\n\r\nHinzufügen und Bearbeiten\r\n\r\nNeues Thema mit der Schaltfläche Thema hinzufügen erstellen\r\nBestehendes Thema durch Klicken auf das Themensymbol in der 3D-Ansicht öffnen\r\n\r\nBearbeitungspanel\r\n\r\nGrundinformationen:\r\nName Themenname, in der 3D-Ansicht über dem Symbol angezeigt\r\nBeschreibung Mehrzeilige Textbeschreibung\r\nTyp Hinweis / Kommentar / Idee / Aufgabe / Problem / Risiko / Anforderung\r\nPriorität Niedrig / Normal / Hoch / Kritisch\r\nStatus Kanban-artiger Status\r\nTags Eigene Tags hinzufügen\r\n\r\nZusatzinformationen:\r\nAnsichtspunkte Themen können mehrere Ansichtspunkte haben\r\nObjekte Liste verknüpfter Objekte\r\n\r\nWorkflows:\r\nVordefinierte Prozesse mit Schritten, Verantwortlichen und Checklisten.\r\n\r\nAktionen:\r\nAnsichtspunkt Ansichtspunkte zum Thema speichern\r\nStandort Themenstandort in 3D setzen\r\nMit Objekten verknüpfen Objekte auswählen und verknüpfen\r\nSpeichern / Abbrechen"},{"slug":"themenbericht","title":"Themenbericht","description":"Alle Projektthemen in einer Tabelle zusammenfassen und als Excel exportieren.","category":"Hauptwerkzeuge","content":"Der Themenbericht fasst alle Projektthemen in einer leicht lesbaren Tabelle zusammen.\r\n\r\nFunktionalität\r\n\r\nThemen in der Tabelle mit Scrollbalken durchblättern\r\nSpaltenüberschriften zeigen die Themenzusammenfassung\r\nBei Themen mit Workflows gibt es für jeden Workflow eine separate Tabelle\r\nExport Themenbericht nach Excel exportieren\r\n\r\nTipps\r\n\r\nVerwenden Sie den Themenbericht zur Berichterstattung an Endkunden. Er zeigt jedes Projektthema, Status und Workflow-Schritte. Dies wird automatisch erstellt und spart Ihre Zeit."},{"slug":"themenliste","title":"Themenliste","description":"Alle Projektthemen durchsuchen und filtern.","category":"Hauptwerkzeuge","content":"Das Themenlisten-Werkzeug dient der Verwaltung großer Themenmengen mit Sortierund Filterwerkzeugen.\r\n\r\nFunktionalität\r\n\r\nSortieren Klicken Sie auf eine Spaltenüberschrift zum Sortieren\r\nFiltern Klicken Sie auf das Filtersymbol zur Filterregeldefinition\r\nSchnellfilter Klicken Sie auf einen Zellenwert zum Filtern\r\nAuswählen Themen mit Kontrollkästchen auswählen\r\nLöschen Ausgewählte Themen löschen\r\nNeu Neue Themen erstellen\r\n\r\nHinweis: Bei vielen Themen werden diese auf mehreren Seiten angezeigt.\r\n\r\nTipps\r\n\r\nKlicken Sie auf Ihren Namen im Feld Person, um Ihnen zugewiesene Themen schnell aufzulisten"},{"slug":"versionshinweise","title":"Versionshinweise","description":"Zusammenfassung jeder Version; neue Funktionen, Verbesserungen.","category":"Verwaltung","content":"2026.01.2\r\n\r\nVeröffentlicht am 30. Januar 2026\r\n\r\nVerbesserungen\r\n\r\nAnimationen der Ansichtskamera\r\nBildexport von Ansichtspunkten\r\nMaterialwerkzeug zur automatischen Visualisierung\r\nVideoexport von Ansichtspunkten für Kameraanimationen\r\nKMZ / KML Metadatenanzeige in ObjectInfo\r\nAktualisierung der Ansichtspunkt-Symbolleiste\r\n\r\nFehlerbehebungen\r\n\r\nProbleme beim Speichern und Laden von Berechnungen\r\nEinige Modelle wurden nach dem Import nicht korrekt angezeigt\r\n4D Gantt MS-Project-Import korrekt unter ausgewählter Unteraufgabe\r\nProjekte erschienen nicht immer in der Organisationsprojektliste\r\nAzureAD Anmeldeverbesserungen"},{"slug":"zeitleiste","title":"Zeitleiste","description":"Zeit anpassen und das Projekt bei verschiedenen Lichtverhältnissen betrachten.","category":"Hauptwerkzeuge","content":"Das Zeitleisten-Werkzeug wird zur Änderung der aktuellen Projektzeit verwendet, z.B. für Schattenanalysen.\r\n\r\nFunktionalität\r\n\r\nGenaue Zeit mit Datums-/Zeitauswahl einstellen\r\nAktive Zeit mit Vor-/Zurück-Tasten anpassen\r\nZeit mit der Maus auf dem Zeitleisten-Schieberegler bewegen\r\nZeitleisten-Animation mit Play-Taste abspielen\r\nAktive Zeitskala anpassen: Stunde / Tag / Woche / Monat / Jahr\r\n\r\nTipps\r\n\r\nFühren Sie eine Sonnenschattenanalyse durch:\r\n1. Schatten in Systemeinstellungen aktivieren\r\n2. Aktive Startzeit genau einstellen\r\n3. Zeitskala auf Stunden setzen\r\n4. Zeitleisten-Schieberegler von links nach rechts bewegen\r\n5. Animation mit Play-Taste abspielen"}]