[{"slug":"4d-gantt","title":"4D Gantt","description":"Create schedules and link tasks to project objects and visualize schedules as 4D simulation.","category":"Main Tools","content":"4D Gantt is a powerful scheduling tool that replaces separate scheduling tools like MS Project or Primavera. It is used for managing project schedules.\r\n\r\nToolbar\r\n\r\nImport Import schedule from MS Project, Primavera and IFC formats\r\nExport Export schedule to MS Project, Primavera, PDF, PNG, Excel or iCal formats\r\nSet as baseline Saves the current schedule as a baseline for comparison\r\nUndo / Redo Undo or redo changes\r\n\r\nTasks\r\n\r\nAdd tasks with the Plus button\r\nEdit task name, start and end date, duration and progress\r\nHierarchical structure: tasks can contain subtasks\r\nLink tasks to each other with dependencies (FS, FF, SS, SF)\r\n\r\n4D Simulation\r\n\r\nLink tasks to model objects and visualize the schedule as a 4D simulation. With the Timeline tool you can play the animation and see the project progress over time."},{"slug":"calculations","title":"Calculations","description":"Sum up project or model quantities even at object level.","category":"Main Tools","content":"The Calculation tool is a powerful spreadsheet calculation that enables calculations based on data model object metadata.\r\n\r\nFunctionality\r\n\r\nNew Create a new calculation\r\nName Calculation name\r\nLevel Calculation is based on file or object attributes\r\nSave Save the current calculation\r\nExport Export the current calculation in Excel format\r\n\r\nSpreadsheet\r\n\r\nData Select content for the first column\r\n  Folder Separate rows by data tree folders\r\n  Attribute Separate rows by object attribute values\r\nColumn Select calculation content for columns\r\n  Summary Calculates the total sum of selected attribute values\r\n  Quantity Counts the number of objects\r\n\r\nCell Rules\r\n\r\nSpreadsheet cells can contain all kinds of formulas. Almost all the same formulas are supported as in Excel.\r\n\r\nTips\r\n\r\nCreate a quick cost calculation: select Data: Attribute \"Material\" Column: Attribute \"Volume\". Add columns \"Unit Price\" and \"Total Price\" with your own formulas."},{"slug":"clipping-plane","title":"Clipping Plane","description":"Clip models horizontally, vertically or along a road centerline.","category":"Main Tools","content":"The Clipping Plane tool is used to cut models open and create cross-section views in 3D space.\r\n\r\nHorizontal\r\n\r\nThe horizontal clipping plane cuts models horizontally. This is useful for examining e.g. building floor plans.\r\n\r\nVertical\r\n\r\nThe vertical clipping plane cuts models vertically along a straight line between two points. This is useful for e.g. examining building structures along a wall line.\r\n\r\nAlong Road Centerline\r\n\r\nThe road centerline clipping cuts models similar to a vertical clip, but perpendicular to and following the road centerline. You can adjust the clipping plane position by station number."},{"slug":"data-management","title":"Data Management","description":"Add, edit and organize project data sources.","category":"Main Tools","content":"The data tree tool is used to manage all project data sources, organize them into folders, manage access rights, and control how data appears in 3D views.\r\n\r\nToolbar\r\n\r\nAdd data Opens a dialog with tabs for different data types. Select the data type, choose data type-specific import settings and press the Add button.\r\nAdd folder Adds a new folder under the currently selected folder.\r\nUpdate data Upload a new version of a model file. This creates a new version that appears in the data tree under the model hierarchy.\r\nDownload Download the selected data file.\r\nData settings Adjust settings for the selected data source.\r\nRename Rename the data source with a new name.\r\nHide Make the data source visible / hide it.\r\nZoom to data Move the current view to fit the data source.\r\nRe-import Re-import the selected data source.\r\nDelete Delete the selected data."},{"slug":"display-modes","title":"Display Modes","description":"Switch between 2D, 3D, GPS, fullscreen and VR modes.","category":"Basics","content":"The tool has the following viewing modes:\r\n\r\n3D – Default mode that displays the view in 3D perspective mode\r\n2D – Isometric top-down view, also commonly known as \"map view\". Removes the perspective view.\r\nGPS – Activates the device's GPS positioning and zooms to the device location. GPS mode also has a compass mode that rotates the user's view to the directional device compass points.\r\nVR – Activates dual rendering mode that displays an image rendered for both eyes. Can be used with VR headsets that support such visualization modes."},{"slug":"feedback-report","title":"Feedback Report","description":"Compile all feedback into one table and export to Excel for detailed analysis.","category":"Main Tools","content":"The Feedback Report is used to combine all feedback into one table to facilitate feedback analysis.\r\n\r\nFunctionality\r\n\r\nScroll through feedback responses in the table\r\nExport the feedback table as an Excel file for further analysis\r\nEmoji responses are stored as numbers in the Excel file in order of the emoji icon (default 0 = very happy and 4 = very unhappy)\r\n\r\nTips\r\n\r\nPerform feedback statistics in Excel by calculating the mean, median, etc. of feedback results\r\nAnalyze feedback with AI by downloading the feedback report to Excel and asking questions to AI"},{"slug":"feedback","title":"Feedback","description":"Give structured feedback with customizable feedback forms.","category":"Main Tools","content":"The Feedback tool is used to collect feedback from project's internal or external stakeholders, such as the public, local residents, project neighbors, decision-makers and other stakeholders.\r\n\r\nFunctionality\r\n\r\nThe feedback button in the left toolbar opens the general feedback form with questions\r\nFeedback \"?\" icons in the 3D view open location-linked feedback forms\r\nEach feedback form is different and is defined by the project team\r\nAnswer the feedback questions and press the Submit button"},{"slug":"hide","title":"Hide","description":"Hide objects or areas from data sources.","category":"Main Tools","content":"The Hide tool is used to hide parts of existing data sources at project level. For example, you can hide buildings to be demolished from under new ones.\r\n\r\nHide Objects\r\n\r\nThe tool colors objects that you can hide with random colors\r\nSelect in the 3D view the objects you want to hide. Selected objects turn red.\r\nSelect red objects you want back visible, or use the \"Show all\" button.\r\nThe Save button saves the list of hidden objects\r\n\r\nHide Area\r\n\r\nThe Area button starts the area drawing function\r\nDraw a polyline around the area you want to hide\r\nFinally right-click to finish drawing"},{"slug":"measurement","title":"Measurement","description":"Measure points, distances, lengths and areas.","category":"Main Tools","content":"The Measurement tool is used to take and mark measurements in the 3D view.\r\n\r\nMeasurement Types\r\n\r\nPoint Measure coordinates of a single point\r\nDistance Measure the distance between two points\r\nLength Measure the total length of a polyline\r\nArea Measure the area of a polyline region\r\n\r\nFunctionality\r\n\r\nClick in the 3D view to set measurement points\r\nMeasurement results are displayed in real time\r\nMeasurements can be saved to the project"},{"slug":"navigation","title":"Navigation","description":"Navigate easily with a mouse or touch screens.","category":"Basics","content":"Mouse\nMouse navigation follows the familiar navigation from common map applications:\nLeft button Pan from place to place while maintaining the same height and camera angle\nMiddle button Zoom in / out either by pressing the button and moving the mouse or using the mouse wheel\nRight button Rotate around the object under the mouse cursor horizontally / vertically\nAll navigation takes the object under the mouse as the center point of navigation. By pointing at e.g. a building corner, you can rotate around that corner.\nTouch Screens\nTouch screen navigation also follows familiar navigation from common map applications:\nOne finger Pan the same way as with a mouse\nPinch with two fingers Zoom in or out the same way as with a mouse\nRotate with two fingers Rotate the same way as with a mouse"},{"slug":"organization-management","title":"Organization Management","description":"Manage users, projects, licenses, database space and libraries at organization level.","category":"Administration","content":"The organization management tool is only available to organization administrators and is used for managing the organization's projects, users, licenses, usage quotas, as well as organization-level libraries and logs.\r\n\r\nSettings\r\n\r\nEdit organization's basic information:\r\n\r\nLogo The logo is displayed in the top right corner of all projects. Only available if a special whitelabel license has been purchased.\r\nName\r\nAddress\r\nEmail addresses new users are automatically assigned as organization users if the user's email domain is one of the domains listed here\r\n\r\nProjects\r\n\r\nList of all projects created in this organization.\r\n\r\nAdd new project Adds a new project under the organization\r\nEdit Edit the project's basic settings without opening the project\r\nDelete Deletes the project\r\n\r\nUsers\r\n\r\nList of all users created in this organization.\r\n\r\nRole The user's role in the organization"},{"slug":"profile-settings","title":"Profile Settings","description":"Manage user profile information and settings.","category":"Basics","content":"Profile settings are used to edit the user profile:\r\n\r\nProfile picture – User's personal image. Currently not in use, reserved for future features.\r\nUsername – Change the user's username, which is the user's display name in many tools.\r\nEmail – Change the user's email address. This requires a working email, as the new email address is verified before it becomes active.\r\nFirst and last names – User's real name\r\nLanguage – Language used in the user interface. 6DPlanner is translated into multiple languages, so users can use the tool in their native language. The language setting also affects how numbers, dates, and other values are displayed.\r\nDelete my account – Delete the user account. Be careful when using this, as it cannot be reversed. Users are permanently removed from the system.\r\nChange password – Change the user's password."},{"slug":"project-list","title":"Project List","description":"Manage user's own projects and create new projects.","category":"Basics","content":"The project list shows all projects you are a member of. The list is divided into three sections:\r\n\r\nMy projects – projects you have created\r\nInvited projects – projects that other users have invited you to\r\nProject templates – project templates used to create new projects\r\n\r\nEach project has buttons for project management:\r\n\r\nProject settings – Access basic project settings directly without opening the project\r\nLeave – Leave a project you have joined by invitation. This only applies to invited projects.\r\nClone project – Create a copy of the project, for example to create multiple versions of the same project\r\nDelete – Deletes the project. Deleted projects are only marked as deleted and data is retained for 30 days in case of accidental deletion. If you want to restore a project, contact support. After 30 days, a deleted project can no longer be restored."},{"slug":"project-settings","title":"Project Settings","description":"Manage users, roles, property data, libraries, feedback forms, workflows and other settings at project level.","category":"Basics","content":"Project settings define project-specific settings for different tools.\r\n\r\nNote: Some settings are only available for project manager user roles.\r\n\r\nGeneral Settings\r\n\r\nProject Image\r\n\r\nThe project image allows setting a thumbnail for the project in the project list. By default, it is automatically created from the project's first view.\r\n\r\nStart Image\r\n\r\nThe start image allows setting a custom quick-help image that is shown to users when they open the project.\r\n\r\nProject Name\r\n\r\nThe project name is shown in the project list and in the browser title as the web page name.\r\n\r\nCoordinate System\r\n\r\nThe active coordinate system used for example in model placement or displaying coordinates in the Measurement tool."},{"slug":"queries","title":"Queries","description":"Find model objects using even complex search criteria.","category":"Main Tools","content":"The Query tool is a powerful integrated database search that enables quick finding of BIM objects from large project data.\r\n\r\nFunctionality\r\n\r\nNew Define a new query rule\r\nSave Save an existing query rule\r\nExecute Execute the actively selected query rule\r\n\r\nRule Editor\r\n\r\nUse AND / OR / XOR rules to define multiple conditions\r\nUse \"Folder\" rule to limit queries to a specific folder\r\nUse \"Attribute\" rule to search based on attribute values\r\nUse \"Data type\" rule to limit queries to specific data types\r\n\r\nResult Style\r\n\r\nResult Presentation styles for results\r\nOthers Presentation styles for other data\r\nColor Object color\r\nTransparency Object transparency\r\nVisibility Force results visible / hidden\r\n\r\nTips\r\n\r\nLink query results to 4D Gantt schedule tasks for object-level scheduling. This way tasks always find objects based on query rules, even when models are updated."},{"slug":"release-notes","title":"Release Notes","description":"Summary of each release; new features, improvements.","category":"Administration","content":"2026.01.2\r\n\r\nReleased January 30, 2026\r\n\r\nImprovements\r\n\r\nViewpoint camera animations\r\nViewpoint image export\r\nMaterials tool for automatic visualization\r\nViewpoint video export for camera animations\r\nKMZ / KML metadata display in ObjectInfo\r\nViewpoint toolbar update\r\n\r\nFixes\r\n\r\nCalculation save and load issues\r\nSome models did not display correctly after import\r\n4DGantt MS Project import correctly under selected subtask\r\nProjects did not always appear in Organization project list\r\nAzureAD login improvements"},{"slug":"sketch-models","title":"Sketch Models","description":"Quickly and easily sketch 3D objects, lines, areas and volume models for various use cases.","category":"Main Tools","content":"The Sketch Model tool is a powerful smart modeling tool. Sketch Model tools are used for modeling quick simple sketch models.\r\n\r\nElement\r\n\r\nAdd individual elements with location and radius. Select a 3D model from the Library to place 3D objects in the project.\r\n\r\nSuitable for e.g. landscaping plans, urban furniture and construction site machinery modeling.\r\n\r\nLine\r\n\r\nAdd polyline elements with line points, width and height. When height = 0, the line follows all models and ground below the line.\r\n\r\nSuitable for e.g. outlining roads, tracks, fences or construction site ditches.\r\n\r\nArea\r\n\r\nAdd polyline areas with corner points and height. When height = 0, the area follows the ground surface.\r\n\r\nSuitable for e.g. outlining building masses, parking areas or park areas.\r\n\r\nVolume\r\n\r\nAdd volume models with corner points and height.\r\n\r\nSuitable for e.g. modeling earthwork masses, excavations or fills."},{"slug":"snapshot","title":"Snapshot","description":"Quickly see the project status through a single consolidated visual dashboard.","category":"Main Tools","content":"The Snapshot tool is used to summarize the project status into a single-page status report with multiple analytical views.\r\n\r\nFunctionality\r\n\r\nTime range selector Select the time range for which the status report is collected\r\nTopics Pie and Table Shows a summary of topics as a pie chart and table\r\nVelocity Analysis of how quickly topics progress or are closed\r\nActive topics Chart of topic progress history\r\nProject completion Shows how complete the project is based on topic statuses\r\n\r\nTips\r\n\r\nUse this automatic snapshot dashboard to communicate project status to stakeholders."},{"slug":"system-settings","title":"System Settings","description":"Manage general settings that affect tool behavior.","category":"Basics","content":"System settings change the behavior of the application.\r\n\r\nGeneral\r\n\r\nThe following settings can be quickly toggled on/off:\r\n\r\nGlobe Global terrain model and background maps. When off, hides terrain and background maps.\r\nProject plane Virtual project plane, if import is set to use \"Plane\" mode\r\nAnti-aliasing Edge anti-aliasing\r\nShadows Shadows from sunlight\r\nHUD Information display for rendering speed, such as fps\r\nSave battery Display is not updated when no changes occur in the 3D view\r\nAmbient occlusion Ambient occlusion effect that simulates light bouncing off surfaces\r\nInspection tool Special tool for inspecting model objects\r\nBounding volume Shows the volumes of the selected model data\r\n\r\nSettings\r\n\r\nThe following settings can be fine-tuned:\r\n\r\nBackground color Adjust the background color visible when the globe is turned off"},{"slug":"technical-documentation","title":"Technical Documentation","description":"Technical documentation for organization IT administration.","category":"Administration","content":"Architecture\r\n\r\n6DPlanner is implemented on top of AWS (Amazon Web Services) cloud architecture and infrastructure. The servers and data are located in AWS data centers close to users, depending on user's region.\r\n\r\nThe service is based on a modern \"serverless\" cloud architecture, where processes are started as needed in parallel, which theoretically enables unlimited scalability based on usage needs.\r\n\r\nHigh performance end user experience on client devices has been implemented with unique intelligent multi-resolution object level web streaming CesiumJS technology, which enables dynamic loading of data based on the viewer's location."},{"slug":"timeline","title":"Timeline","description":"Adjust time and see the project in different lighting conditions.","category":"Main Tools","content":"The Timeline tool is used to change the current time of the project, and can be used for example for shadow analysis.\r\n\r\nFunctionality\r\n\r\nSet the exact time with the date and time picker\r\nAdjust the active time with forward / backward buttons\r\nMove time with the mouse on the timeline slider\r\nPlay timeline animation with the Play button\r\nAdjust the timeline's active time scale: hour / day / week / month / year\r\n\r\nTips\r\n\r\nPerform sun shadow analysis with the timeline:\r\n1. Enable shadows in system settings\r\n2. Set the active start time precisely in the time picker\r\n3. Set the time scale to hours\r\n4. Move the timeline slider from left to right to simulate sunlight shadows at different times\r\n5. You can also play the shadow analysis animation with the Play button"},{"slug":"topic-list","title":"Topic List","description":"Search and filter all project topics.","category":"Main Tools","content":"The Topic List tool is used to manage large numbers of topics easily with sorting and filtering tools.\r\n\r\nFunctionality\r\n\r\nSort Click a column header to sort the content\r\nFilter Click the filter icon in the column header to define a filter rule\r\nQuick filter Click a cell value to filter only those values\r\nSelect Select topics using the checkbox on the left side of the table\r\nDelete Delete selected topics with the Delete button\r\nNew Create new topics\r\n\r\nNote: If there are many topics, they are listed on multiple pages. You can switch between pages from the page tool in the bottom right corner.\r\n\r\nTips\r\n\r\nClick your name in the Person field to quickly list topics assigned to you"},{"slug":"topic-report","title":"Topic Report","description":"Compile all project topics into one table and export to Excel for detailed analysis.","category":"Main Tools","content":"The Topic Report tool is used for reporting and summarizing all project topics into an easily readable table.\r\n\r\nFunctionality\r\n\r\nBrowse topics using the table with a scrollbar\r\nHeader columns show the topic summary\r\nIf topics have workflows, each workflow has a separate table\r\nExport Export the topic report to Excel for further use\r\n\r\nTips\r\n\r\nUse the topic report for reporting project status to end clients. The topic report shows every project topic, their status and workflow steps. This is generated automatically and saves your time."},{"slug":"topics","title":"Topics","description":"Manage goals, requirements, tasks, risks, ideas, issues linked to location and data.","category":"Main Tools","content":"The Topics tool is a powerful collaboration tool for managing various project topics such as tasks, issues, risks, requirements, comments, notes.\r\n\r\nTopic Editor\r\n\r\nAdd and Edit\r\n\r\nAdd a new topic using the Add Topic button in the right toolbar\r\nOpen an existing topic by clicking the Topic icon in the 3D view\r\n\r\nEdit Panel\r\n\r\nBasic Information:\r\nName Topic name, displayed in the 3D view above the topic icon\r\nDescription Topic description as multi-line text\r\nType Notice / Comment / Idea / Task / Issue / Risk / Requirement\r\nPriority Low / Normal / High / Critical\r\nStatus Kanban-style status for the topic\r\nTags Add your own tags to topics\r\n\r\nAdditional Information:\r\nViewpoints Topics can have multiple viewpoints\r\nObjects List of objects related to the topic\r\n\r\nWorkflows:\r\nWorkflows are predefined processes with steps, each step having its own responsible persons and checklists.\r\n\r\nActions:\r\nViewpoint Save viewpoints to the topic\r\nLocation Set the topic's location in 3D\r\nLink to objects Select and link objects to the topic\r\nSave / Cancel"},{"slug":"viewpoints","title":"Viewpoints","description":"Save viewpoints and create presentations from different situations and scenarios.","category":"Main Tools","content":"The Viewpoints tool is a powerful presentation tool that replaces separate presentation tools like PowerPoint. The Viewpoints tool is used to save predefined views.\r\n\r\nFunctionality\r\n\r\nClick a viewpoint to activate it\r\nClick the Update icon to update the viewpoint\r\nClick the Delete icon to delete the viewpoint\r\nDouble-click the viewpoint name to edit it\r\n\r\nViewpoints save and load the following settings:\r\n\r\nCamera view\r\nTimeline time\r\nData source visibility and clipping\r\nRendering settings such as shadows\r\n\r\nTips\r\n\r\nCreate interactive presentations with viewpoints, like a PowerPoint slideshow\r\nShare presentations by sharing the project link with viewers"}]