[{"slug":"4d-gantt","title":"4D Gantt","description":"Loo ajakavasid ja seo ülesandeid projekti objektidega ning visualiseeri ajakavasid 4D simulatsioonina.","category":"Põhitööriistad","content":"4D Gantt on võimas ajakava tööriist, mis asendab eraldi ajakava tööriistu nagu MS Project või Primavera. Seda kasutatakse projekti ajakavade haldamiseks.\r\n\r\nTööriistariba\r\n\r\nImport Impordi ajakava MS Projectist, Primaverast ja IFC formaatidest\r\nEksport Ekspordi ajakava MS Projecti, Primaverasse, PDF-, PNG-, Excelvõi iCal-formaatidesse\r\nSea aluseks Salvestab praeguse ajakava alusena võrdlemiseks\r\nTagasi / Uuesti Tühista või tee muudatused uuesti\r\n\r\nÜlesanded\r\n\r\nLisa ülesandeid pluss-nupuga\r\nMuuda ülesande nime, algusja lõppkuupäeva, kestust ja edenemist\r\nHierarhiline struktuur: ülesanded võivad sisaldada alamülesandeid\r\nSeo ülesandeid omavahel sõltuvustega (FS, FF, SS, SF)\r\n\r\n4D Simulatsioon\r\n\r\nSeo ülesandeid mudeli objektidega ja visualiseeri ajakava 4D simulatsioonina. Ajatelje tööriistaga saad esitada animatsiooni ja näha projekti edenemist ajas."},{"slug":"ajatelg","title":"Ajatelg","description":"Reguleeri aega ja vaata projekti erinevates valgustingimustes.","category":"Põhitööriistad","content":"Ajatelje tööriista kasutatakse projekti praeguse aja muutmiseks ja seda saab kasutada näiteks varjuanalüüsiks.\r\n\r\nFunktsionaalsus\r\n\r\nSea täpne aeg kuupäevaja ajavalijaga\r\nReguleeri aktiivset aega edasi / tagasi nuppudega\r\nLiiguta aega hiirega ajatelje liuguril\r\nMängi ajatelje animatsiooni Mängi nupuga\r\nReguleeri ajatelje aktiivset ajaskaalat: tund / päev / nädal / kuu / aasta\r\n\r\nNäpunäited\r\n\r\nTeosta päikese varjuanalüüs ajateljega:\r\n1. Lülita varjud sisse süsteemiseadetes\r\n2. Sea aktiivne algusaeg täpselt ajavalijaga\r\n3. Sea ajaskaala tundidele\r\n4. Liiguta ajatelje liugurit vasakult paremale päikesevalguse varjude simuleerimiseks erinevatel aegadel\r\n5. Saad ka esitada varjuanalüüsi animatsiooni Mängi nupuga"},{"slug":"andmete-haldamine","title":"Andmete haldamine","description":"Lisa, muuda ja organiseeri projekti andmeallikaid.","category":"Põhitööriistad","content":"Andmepuu tööriista kasutatakse kõigi projekti andmeallikate haldamiseks, nende korraldamiseks kaustadesse, juurdepääsuõiguste haldamiseks ja selle kontrollimiseks, kuidas andmed 3D-vaadetes kuvatakse.\r\n\r\nTööriistariba\r\n\r\nLisa andmeid Avab dialoogi erinevate andmetüüpide vahekaartidega. Vali andmetüüp, vali andmetüübile spetsiifilised impordiseaded ja vajuta Lisa nuppu.\r\nLisa kaust Lisab uue kausta hetkel valitud kausta alla.\r\nVärskenda andmeid Laadi mudeli faili uus versioon. See loob uue versiooni, mis kuvatakse andmepuus mudeli hierarhias.\r\nLaadi alla Laadi valitud andmefail alla.\r\nAndmete seaded Reguleeri valitud andmeallika seadeid.\r\nNimeta ümber Nimeta andmeallikas uue nimega ümber.\r\nPeida Tee andmeallikas nähtavaks / peida see.\r\nSuumi andmetele Liiguta praegust vaadet andmeallika suurusele.\r\nImpordi uuesti Impordi valitud andmeallikas uuesti.\r\nKustuta Kustuta valitud andmed."},{"slug":"arvutused","title":"Arvutused","description":"Summeeri projekti või mudelite koguseid isegi objekti tasemel.","category":"Põhitööriistad","content":"Arvutuste tööriist on võimas tabelarvutus, mis võimaldab arvutusi andmemudeli objektide metaandmete põhjal.\r\n\r\nFunktsionaalsus\r\n\r\nUus Loo uus arvutus\r\nNimi Arvutuse nimi\r\nTase Arvutus põhineb faili või objekti atribuutidel\r\nSalvesta Salvesta praegune arvutus\r\nEksport Ekspordi praegune arvutus Excel-formaadis\r\n\r\nArvutustabel\r\n\r\nAndmed Vali esimese veeru sisu\r\n  Kaust Eralda ridade kaupa andmepuu kaustad\r\n  Atribuut Eralda ridade kaupa objekti atribuutide väärtused\r\nVeerg Vali arvutuse sisu veergudesse\r\n  Kokkuvõte Arvutab valitud atribuutide väärtuste kogusumma\r\n  Kogus Loendab objektide arvu\r\n\r\nLahtrireeglid\r\n\r\nArvutustabeli lahtrid võivad sisaldada igasuguseid valemeid. Peaaegu kõik samad valemid on toetatud nagu Excelis.\r\n\r\nNäpunäited\r\n\r\nLoo kiire kuluarvutus: vali Andmed: Atribuut \"Materjal\" Veerg: Atribuut \"Maht\". Lisa veerud \"Ühikuhind\" ja \"Koguhind\" oma valemitega."},{"slug":"eskiismudelid","title":"Eskiismudelid","description":"Eskiisi kiiresti ja lihtsalt 3D-objekte, jooni, alasid ja mahumudeleid erinevateks kasutusotstarveteks.","category":"Põhitööriistad","content":"Eskiismudeli tööriist on võimas intelligentne modelleerimistööriist. Eskiismudeli tööriistu kasutatakse kiirete lihtsate eskiismudelite modelleerimiseks.\r\n\r\nElement\r\n\r\nLisa üksikuid elemente asukoha ja raadiusega. Vali 3D-mudel raamatukogust 3D-objektide projektisse paigutamiseks.\r\n\r\nSobib nt maastikuplaneerimise, linnamööbli ja ehitusplatsi masinate modelleerimiseks.\r\n\r\nJoon\r\n\r\nLisa murdjoon-elemente joonepunktide, laiuse ja kõrgusega. Kui kõrgus = 0, järgib joon kõiki mudeleid ja maapinda joone all.\r\n\r\nSobib nt teede, rööbaste, aedade või ehitusplatsi kraavide visandamiseks.\r\n\r\nAla\r\n\r\nLisa murdjoon-alasid nurgapunktide ja kõrgusega. Kui kõrgus = 0, järgib ala maapinda.\r\n\r\nSobib nt ehitusmasside, parkimisalade või pargialade visandamiseks.\r\n\r\nMaht\r\n\r\nLisa mahumudeleid nurgapunktide ja kõrgusega.\r\n\r\nSobib nt muldkehade, kaevandite või täidete modelleerimiseks."},{"slug":"hetkeuelevaade","title":"Hetkeülevaade","description":"Vaata kiiresti projekti olekut ühe koondava visuaalse paneeli kaudu.","category":"Põhitööriistad","content":"Hetkeülevaate tööriista kasutatakse projekti oleku kokkuvõtmiseks ühelehekülje tüüpi olekuraportiks mitme analüütilise vaatega.\r\n\r\nFunktsionaalsus\r\n\r\nAjavahemiku valija Vali ajavahemik, mille kohta olekuraport koostatakse\r\nTeemade pirukas ja tabel Näitab teemade kokkuvõtet pirukdiagrammi ja tabelina\r\nKiirus Analüüs sellest, kui kiiresti teemad edenevad või suletakse\r\nAktiivsed teemad Teemade edenemise ajaloo diagramm\r\nProjekti valmidus Näitab, kui valmis projekt on teemade olekute põhjal\r\n\r\nNäpunäited\r\n\r\nKasuta seda automaatset hetkeülevaate paneeli projekti oleku edastamiseks sidusrühmadele."},{"slug":"kuvarežiimid","title":"Kuvarežiimid","description":"Vaheta 2D, 3D, GPS, täisekraani ja VR režiimide vahel.","category":"Põhitõed","content":"Tööriistal on järgmised vaaterežiimid:\r\n\r\n3D – Vaikerežiim, mis kuvab vaate 3D perspektiivrežiimis\r\n2D – Isomeetriline ülevaltvaade, mida nimetatakse tavaliselt ka \"kaardivaadeteks\". Eemaldab perspektiivvaate.\r\nGPS – Aktiveerib seadme GPS-positsioneerimise ja suumib seadme asukohale. GPS-režiimil on ka kompassirežiim, mis pöörab kasutaja vaate suunaseadme kompassipunktide järgi.\r\nVR – Aktiveerib topeltrenderdamise režiimi, mis kuvab mõlemale silmale renderdatud pildi. Saab kasutada VR-peakomplektidega, mis toetavad selliseid visualiseerimisrežiime."},{"slug":"loiketasand","title":"Lõiketasand","description":"Lõika mudeleid horisontaalselt, vertikaalselt või tee keskteljega.","category":"Põhitööriistad","content":"Lõiketasandi tööriista kasutatakse mudelite lahti lõikamiseks ja ristlõikevaadete loomiseks 3D-ruumis.\r\n\r\nHorisontaalselt\r\n\r\nHorisontaalne lõiketasand lõikab mudeleid horisontaalselt. See on kasulik nt hoone korruste plaanide vaatamiseks.\r\n\r\nVertikaalselt\r\n\r\nVertikaalne lõiketasand lõikab mudeleid vertikaalselt kahe punkti vahelise sirge järgi. See on kasulik nt hoone konstruktsioonide vaatamiseks seina suunas.\r\n\r\nTee keskteljega\r\n\r\nTee kesktelje lõikamine lõikab mudeleid sarnaselt vertikaalsele lõikele, kuid risti tee keskteljega ja seda järgides. Saad reguleerida lõiketasandi asukohta piketaaži järgi."},{"slug":"mootmine","title":"Mõõtmine","description":"Mõõda punkte, vahemaid, pikkusi ja pindalasid.","category":"Põhitööriistad","content":"Mõõtmistööriista kasutatakse mõõtude tegemiseks ja märkimiseks 3D-vaates.\r\n\r\nMõõtmistüübid\r\n\r\nPunkt Mõõda üksiku punkti koordinaadid\r\nVahemaa Mõõda kahe punkti vaheline kaugus\r\nPikkus Mõõda murdjoone kogupikkus\r\nPindala Mõõda murdjoon-ala pindala\r\n\r\nFunktsionaalsus\r\n\r\nKlõpsa 3D-vaates mõõtmispunktide seadmiseks\r\nMõõtmistulemused kuvatakse reaalajas\r\nMõõtmisi saab salvestada projekti"},{"slug":"navigeerimine","title":"Navigeerimine","description":"Navigeeri hõlpsalt hiire või puuteekraaniga.","category":"Põhitõed","content":"Hiirega\r\n\r\nHiirega navigeerimine järgib levinud kaardirakenduste navigeerimist:\r\n\r\nVasak nupp Panoraami kohast kohta, hoides samal ajal kõrgust ja kaamera nurka\r\nKeskmine nupp Suumi lähemale / kaugemale, vajutades nuppu ja liigutades hiirt või kasutades hiireratast\r\nParem nupp Pööra hiire kursori all oleva objekti ümber horisontaalselt / vertikaalselt\r\n\r\nKõik navigeerimised võtavad hiire all oleva objekti navigeerimise keskkohaks. Osutades nt hoone nurgale saad pöörata hoone nurga ümber.\r\n\r\nPuuteekraanidel\r\n\r\nPuuteekraanidel navigeerimine järgib samuti levinud kaardirakenduste navigeerimist:\r\n\r\nÜks sõrm Panoraami samamoodi nagu hiirega\r\nNäpista kahe sõrmega Suumi lähemale või kaugemale samamoodi nagu hiirega\r\nPööra kahe sõrmega Pööra samamoodi nagu hiirega"},{"slug":"organisatsiooni-haldamine","title":"Organisatsiooni haldamine","description":"Halda kasutajaid, projekte, litsentse, andmebaasi ruumi ja teeke organisatsiooni tasemel.","category":"Haldamine","content":"Organisatsiooni haldustööriist on saadaval ainult organisatsiooni administraatoritele ja seda kasutatakse organisatsiooni projektide, kasutajate, litsentside, kasutuskvootide ning organisatsioonitaseme teekide ja logide haldamiseks.\r\n\r\nSeaded\r\n\r\nMuuda organisatsiooni põhiteavet:\r\n\r\nLogo Logo kuvatakse kõigi projektide paremas ülanurgas. Saadaval ainult eritingimuste litsentsi ostmisel.\r\nNimi\r\nAadress\r\nE-posti aadressid uued kasutajad määratakse automaatselt organisatsiooni kasutajateks, kui kasutaja e-posti domeen on üks siin loetletud domeenidest\r\n\r\nProjektid\r\n\r\nLoend kõigist selles organisatsioonis loodud projektidest.\r\n\r\nLisa uus projekt Lisab uue projekti organisatsiooni alla\r\nMuuda Muuda projekti põhiseadeid ilma projekti avamata\r\nKustuta Kustutab projekti\r\n\r\nKasutajad\r\n\r\nLoend kõigist selles organisatsioonis loodud kasutajatest.\r\n\r\nRoll Kasutaja roll organisatsioonis"},{"slug":"paringud","title":"Päringud","description":"Leia mudeli objekte ka keerukate otsikriteeriumide abil.","category":"Põhitööriistad","content":"Päringu tööriist on võimas integreeritud andmebaasiotsing, mis võimaldab BIM-objektide kiiret leidmist suurtest projektiandmetest.\r\n\r\nFunktsionaalsus\r\n\r\nUus Määratle uus päringu reegel\r\nSalvesta Salvesta olemasolev päringu reegel\r\nKäivita Käivita aktiivselt valitud päringu reegel\r\n\r\nReegliredaktor\r\n\r\nKasuta AND / OR / XOR reegleid mitme tingimuse määratlemiseks\r\nKasuta \"Kaust\" reeglit päringute piiramiseks kindla kaustaga\r\nKasuta \"Atribuut\" reeglit otsimiseks atribuutide väärtuste põhjal\r\nKasuta \"Andmetüüp\" reeglit päringute piiramiseks kindlate andmetüüpidega\r\n\r\nTulemuse stiil\r\n\r\nTulemus Esitlusstiilid tulemustele\r\nMuud Esitlusstiilid muudele andmetele\r\nVärv Objektide värv\r\nLäbipaistvus Objektide läbipaistvus\r\nNähtavus Sunnitud tulemused nähtavaks / peidetuks\r\n\r\nNäpunäited\r\n\r\nSeo päringutulemused 4D Gantt ajakava ülesannetega objektitaseme ajastamise tegemiseks. Sel viisil leiavad ülesanded alati objekte päringureeglite põhjal, isegi kui mudeleid uuendatakse."},{"slug":"peida","title":"Peida","description":"Peida objekte või alasid andmeallikatest.","category":"Põhitööriistad","content":"Peida tööriista kasutatakse olemasolevate andmeallikate osade peitmiseks projekti tasemel. Näiteks saad peita lammutatavad hooned uute alt ära.\r\n\r\nPeida objektid\r\n\r\nTööriist värvib objekte, mida saad peita, juhuslike värvidega\r\nVali 3D-vaates need objektid, mida soovid peita. Valitud objektid muutuvad punaseks.\r\nVali punased objektid, mida soovid tagasi nähtavaks teha, või kasuta nuppu \"Näita kõiki\".\r\nSalvesta nupp salvestab peidetud objektide loendi\r\n\r\nPeida ala\r\n\r\nAla nupp käivitab ala joonistamise funktsiooni\r\nJoonista murdjoon ümber ala, mida soovid peita\r\nLõpuks tee paremklõps joonistamise lõpetamiseks"},{"slug":"profiiliseaded","title":"Profiiliseaded","description":"Halda kasutajaprofiili teavet ja seadeid.","category":"Põhitõed","content":"Profiiliseadeid kasutatakse kasutajaprofiili muutmiseks:\r\n\r\nProfiilipilt – Kasutaja isiklik pilt. Hetkel ei ole kasutusel, reserveeritud tulevaste funktsioonide jaoks.\r\nKasutajanimi – Muuda kasutaja kasutajanime, mis on kasutaja kuvanimi paljudes tööriistades.\r\nE-post – Muuda kasutaja e-posti aadressi. See nõuab toimivat e-posti, kuna uus e-posti aadress kinnitatakse enne aktiveerimist.\r\nEesja perekonnanimi – Kasutaja pärisnimi\r\nKeel – Kasutajaliideses kasutatav keel. 6DPlanner on tõlgitud mitmesse keelde, nii et kasutajad saavad tööriista kasutada oma emakeeles. Keeleseade mõjutab ka seda, kuidas numbreid, kuupäevi ja muid väärtusi kuvatakse.\r\nKustuta minu konto – Kustuta kasutajakonto. Ole selle kasutamisel ettevaatlik, kuna seda ei saa tagasi võtta. Kasutajad eemaldatakse süsteemist jäädavalt.\r\nMuuda parooli – Muuda kasutaja parooli."},{"slug":"projektiloend","title":"Projektiloend","description":"Halda kasutaja projekte ja loo uusi projekte.","category":"Põhitõed","content":"Projektiloend näitab kõiki projekte, mille liige oled. Loend on jagatud kolme ossa:\r\n\r\nMinu projektid – sinu loodud projektid\r\nKutsutud projektid – projektid, kuhu teised kasutajad on sind kutsunud\r\nProjektimallid – projektimallid, mida kasutatakse uute projektide loomiseks\r\n\r\nIgal projektil on nupud projektide haldamiseks:\r\n\r\nProjektiseaded – Kasuta projekti põhiseadeid otse ilma projekti avamata\r\nLahku – Lahku projektist, millega liitusid kutse kaudu. See kehtib ainult kutsutud projektide kohta.\r\nKlooni projekt – Loo projektist koopia, näiteks loomaks mitu versiooni samast projektist\r\nKustuta – Kustutab projekti. Kustutatud projektid märgitakse ainult kustutatuks ja andmeid hoitakse 30 päeva juhusliku kustutamise puhuks. Kui soovid projekti taastada, võta ühendust toega. 30 päeva pärast ei saa kustutatud projekti enam taastada."},{"slug":"projektiseaded","title":"Projektiseaded","description":"Halda kasutajaid, rolle, omadusandmeid, teeke, tagasiside vorme, töövooge ja muid seadeid projekti tasemel.","category":"Põhitõed","content":"Projektiseaded määratlevad projektispetsiifilised seaded erinevate tööriistade jaoks.\r\n\r\nMärkus: Mõned seaded on saadaval ainult projektijuhi kasutajarollidele.\r\n\r\nÜldised seaded\r\n\r\nProjekti pilt\r\n\r\nProjektipilt võimaldab seada projekti pisipildi projektiloendis. Vaikimisi luuakse see automaatselt projekti esimesest vaatest.\r\n\r\nAlguspilt\r\n\r\nAlguspilt võimaldab seada kohandatud kiirabi pildi, mis kuvatakse kasutajatele projekti avamisel.\r\n\r\nProjekti nimi\r\n\r\nProjekti nimi kuvatakse projektiloendis ja brauseri pealkirjas veebilehe nimena.\r\n\r\nKoordinaatsüsteem\r\n\r\nAktiivne koordinaatsüsteem, mida kasutatakse näiteks mudeli paigutamisel või koordinaatide kuvamisel mõõtmistööriistas."},{"slug":"susteemiseaded","title":"Süsteemiseaded","description":"Halda üldisi seadeid, mis mõjutavad tööriista käitumist.","category":"Põhitõed","content":"Süsteemiseaded muudavad rakenduse käitumist.\r\n\r\nÜldine\r\n\r\nJärgmisi seadeid saab kiiresti sisse/välja lülitada:\r\n\r\nMaakera Globaalne maastikumudel ja taustakaardid. Välja lülitamisel peidab maastiku ja taustakaardid.\r\nProjektitasand Virtuaalne projektitasand, kui import on seatud kasutama \"Plane\" režiimi\r\nServade silumine Servade silumine\r\nVarjud Varjud päikesevalgusest\r\nHUD Teabekuva renderdamise kiiruse kohta, nagu fps\r\nSäästa akut Ekraani ei värskendata, kui 3D-vaates muudatusi ei toimu\r\nÜmbritsev varjustus Ümbritseva varjustuse efekt, mis simuleerib valguse peegeldumist pindadelt\r\nUurimistööriist Eritööriist mudeli objektide uurimiseks\r\nPiirav maht Näitab valitud mudeliandmete mahte\r\n\r\nSeaded\r\n\r\nJärgmisi seadeid saab täpselt reguleerida:\r\n\r\nTaustavärv Reguleeri taustavärvi, mis on nähtav, kui maakera on välja lülitatud"},{"slug":"tagasiside-raport","title":"Tagasiside raport","description":"Koonda kõik tagasiside ühte tabelisse ja salvesta Excelisse detailsemaks analüüsiks.","category":"Põhitööriistad","content":"Tagasiside raportit kasutatakse kogu tagasiside ühendamiseks ühte tabelisse tagasiside analüüsi hõlbustamiseks.\r\n\r\nFunktsionaalsus\r\n\r\nKeri tagasiside vastuseid tabelis\r\nEkspordi tagasiside tabel Excel-failina jätkuanalüüsiks\r\nEmoji vastused salvestatakse numbritena Excel-failis emoji ikooni järjekorras (vaikimisi 0 = väga rõõmus ja 4 = väga õnnetu)\r\n\r\nNäpunäited\r\n\r\nTeosta tagasiside statistika Excelis arvutades tagasiside tulemuste keskmist, mediaani jne.\r\nAnalüüsi tagasisidet tehisintellektiga laadides tagasiside raporti Excelisse ja esitades küsimusi tehisintellektile"},{"slug":"tagasiside","title":"Tagasiside","description":"Anna struktureeritud tagasisidet kohandatavate tagasiside vormidega.","category":"Põhitööriistad","content":"Tagasiside tööriista kasutatakse tagasiside kogumiseks projekti sisemistelt või välistelt sidusrühmadelt, nagu avalikkus, kohalikud elanikud, projekti naabrid, otsustajad ja muud sidusrühmad.\r\n\r\nFunktsionaalsus\r\n\r\nVasakul tööriistaribal olev tagasiside nupp avab üldise tagasiside vormi küsimustega\r\nTagasiside \"?\" ikoonid 3D-vaates avavad asukohaga seotud tagasiside vormid\r\nIga tagasiside vorm on erinev ja selle määratleb projektimeeskond\r\nVasta tagasiside küsimustele ja vajuta Saada nuppu"},{"slug":"teemad","title":"Teemad","description":"Halda eesmärke, nõudeid, ülesandeid, riske, ideid, probleeme asukohaga ja andmetega seotult.","category":"Põhitööriistad","content":"Teemade tööriist on võimas koostöötööriist projekti erinevate teemade haldamiseks, nagu ülesanded, probleemid, riskid, nõuded, kommentaarid, märkmed.\r\n\r\nTeemaredaktor\r\n\r\nLisa ja muuda\r\n\r\nLisa uus teema kasutades Lisa teema nuppu paremal tööriistaribal\r\nAva olemasolev teema klõpsates Teema ikoonil 3D-vaates\r\n\r\nMuutmispaneel\r\n\r\nPõhiteave:\r\nNimi Teema nimi, kuvatakse 3D-vaates teema ikooni kohal\r\nKirjeldus Teema kirjeldus mitmerealise tekstina\r\nTüüp Teade / Kommentaar / Idee / Ülesanne / Probleem / Risk / Nõue\r\nPrioriteet Madal / Normaalne / Kõrge / Kriitiline\r\nOlek Kanban-stiilis olek teemale\r\nSildid Lisa teemadele oma silte\r\n\r\nLisateave:\r\nVaatepunktid Teemadel võib olla mitu vaatepunkti\r\nObjektid Teemaga seotud objektide loend\r\n\r\nTöövood:\r\nTöövood on eelmääratletud protsessid sammudega, igal sammul on oma vastutavad isikud ja kontroll-loendid.\r\n\r\nToimingud:\r\nVaatepunkt Salvesta vaatepunkte teemasse\r\nAsukoht Sea teema asukoht 3D-s\r\nSeo objektidega Vali ja seo objekte teemaga\r\nSalvesta / Tühista"},{"slug":"teemaloend","title":"Teemaloend","description":"Otsi ja filtreeri kõiki projekti teemasid.","category":"Põhitööriistad","content":"Teemaloendi tööriista kasutatakse suurte teemahulkade haldamiseks sorteerimisja filtreerimistööriistadega.\r\n\r\nFunktsionaalsus\r\n\r\nSorteerimine Klõpsa veeru päisel sisu sorteerimiseks\r\nFiltreerimine Klõpsa filtriikoonil veeru päises filtreerimisreegli määratlemiseks\r\nKiirfilter Klõpsa lahtri väärtusel ainult nende väärtuste filtreerimiseks\r\nVali Vali teemasid kasutades märkekasti tabeli vasakul küljel\r\nKustuta Kustuta valitud teemad Kustuta nupuga\r\nUus Loo uusi teemasid\r\n\r\nMärkus: Kui teemasid on palju, on need loetletud mitmel leheküljel. Saad lehekülgede vahel vahetada paremas alanurgas olevast lehetööriistast.\r\n\r\nNäpunäited\r\n\r\nKlõpsa oma nime Isik väljal, et kiiresti loetleda sulle määratud teemad"},{"slug":"teemaraport","title":"Teemaraport","description":"Koonda kõik projekti teemad ühte tabelisse ja salvesta Excelisse detailsemaks analüüsiks.","category":"Põhitööriistad","content":"Teemaraporti tööriista kasutatakse kõigi projekti teemade raporteerimiseks ja kokkuvõtmiseks kergesti loetavasse tabelisse.\r\n\r\nFunktsionaalsus\r\n\r\nSirvi teemasid kasutades tabelit kerimisribaga\r\nPäise veerud näitavad teemade kokkuvõtet\r\nKui teemadel on töövooge, on igale töövoole eraldi tabel\r\nEksport Ekspordi teemaraport Excelisse jätkukasutuseks\r\n\r\nNäpunäited\r\n\r\nKasuta teemaraportit projekti oleku raporteerimiseks lõppklientidele. Teemaraport näitab iga projekti teemat, nende olekut ja töövoo samme. See luuakse automaatselt ja säästab sinu aega."},{"slug":"tehniline-dokumentatsioon","title":"Tehniline dokumentatsioon","description":"Tehniline dokumentatsioon organisatsiooni IT-haldusele.","category":"Haldamine","content":"Arhitektuur\r\n\r\n6DPlanner on rakendatud AWS (Amazon Web Services) pilvearhitektuuri ja infrastruktuuri peal. Serverid ja andmed asuvad AWS andmekeskustes kasutajate lähedal, sõltuvalt kasutaja piirkonnast.\r\n\r\nTeenus põhineb kaasaegsel \"serverless\" pilvearhitektuuril, kus protsessid käivitatakse vastavalt vajadusele paralleelselt, mis teoreetiliselt võimaldab piiramatut skaleeritavust vastavalt kasutusvajadustele.\r\n\r\nKõrgekvaliteediline kasutajakogemus klientseadmetes on rakendatud unikaalse intelligentse mitme resolutsiooniga objektitaseme veebivootehnoloogia CesiumJS abil, mis võimaldab andmete dünaamilist laadimist vaataja asukoha põhjal."},{"slug":"vaatepunktid","title":"Vaatepunktid","description":"Salvesta vaatepunkte ja loo esitlusi erinevatest olukordadest ja stsenaariumidest.","category":"Põhitööriistad","content":"Vaatepunktide tööriist on võimas esitlustööriist, mis asendab eraldi esitlustööriistu nagu PowerPoint. Vaatepunktide tööriista kasutatakse eelmääratletud vaadete salvestamiseks.\r\n\r\nFunktsionaalsus\r\n\r\nKlõpsa vaatepuntil selle aktiveerimiseks\r\nKlõpsa Värskenda ikoonil vaatepunkti värskendamiseks\r\nKlõpsa Kustuta ikoonil vaatepunkti kustutamiseks\r\nTopeltklõpsa vaatepunkti nimel selle muutmiseks\r\n\r\nVaatepunktid salvestavad ja laadivad järgmised seaded:\r\n\r\nKaameravaade\r\nAjatelje aeg\r\nAndmeallikate nähtavus ja lõikamine\r\nRenderdamise seaded nagu varjud\r\n\r\nNäpunäited\r\n\r\nLoo vaatepunktidega interaktiivseid esitlusi nagu PowerPointi slaidiesitlus\r\nJaga esitlusi jagades projektilinki vaatajatele"},{"slug":"valjalaskemarked","title":"Väljalaskemärkmed","description":"Kokkuvõte igast väljalaskest; uued funktsioonid, parandused.","category":"Haldamine","content":"2026.01.2\r\n\r\nAvaldatud 30. jaanuar 2026\r\n\r\nParandused\r\n\r\nVaatepunkti kaamera animatsioonid\r\nVaatepunkti pildi eksport\r\nMaterjalide tööriist automaatseks visualiseerimiseks\r\nVaatepunkti video eksport kaamera animatsioonidele\r\nKMZ / KML metaandmete kuvamine ObjectInfos\r\nVaatepunkti tööriistariba uuendus\r\n\r\nVeaparandused\r\n\r\nArvutuse salvestamise ja laadimise probleemid\r\nMõned mudelid ei kuvatud pärast importi õigesti\r\n4DGantt MS Projecti import õigesti valitud alamülesande alla\r\nProjektid ei ilmunud alati organisatsiooni projektiloendis\r\nAzureAD sisselogimise parandused"}]