[{"slug":"4d-gantt","title":"4D Gantt","description":"Luo aikatauluja ja linkitä tehtäviä projektin kohteisiin ja visualisoi aikataulut 4D simulaationa.","category":"Päätyökalut","content":"4D Gantt on tehokas aikataulutyökalu, joka korvaa erilliset aikataulutyökalut, kuten MS Project tai Primavera. Sitä käytetään projektiaikataulujen hallintaan.\nTyökalupalkki\nTuonti Tuo aikataulu MS Projectista, Primaverasta ja IFC-muodoista\nVienti Vie aikataulu MS Projectiin, Primaveraan, PDF-, PNG-, Exceltai iCal-muotoihin\nAseta perustasoksi Tallentaa nykyisen aikataulun perustaksi vertailua varten\nKumoa / Tee uudelleen Kumoa tai tee uudelleen muutoksia\nTehtävät\nLisää tehtäviä Plus-painikkeella\nMuokkaa tehtävän nimeä, alkamisja päättymispäivää, kestoa ja edistymistä\nHierarkkinen rakenne: tehtävät voivat sisältää alitehtäviä\nLinkitä tehtäviä toisiinsa riippuvuuksilla (FS, FF, SS, SF)\n4D Simulaatio\nLinkitä tehtävät malliobjekteihin ja visualisoi aikataulu 4D-simulaationa. Aikajana-työkalulla voit toistaa animaation ja nähdä projektin etenemisen ajassa."},{"slug":"aiheet","title":"Aiheet","description":"Hallitse tavoitteita, vaatimuksia, tehtäviä, riskejä, ideoita, ongelmia sijaintiin ja tietoon linkitettynä.","category":"Päätyökalut","content":"Aiheet-työkalu on tehokas yhteistyötyökalu projektin erilaisten aiheiden hallintaan, kuten tehtävät, ongelmat, riskit, vaatimukset, kommentit, muistiinpanot.\nAihe-editori\nLisää ja muokkaa\nLisää uusi aihe käyttämällä Lisää aihe -painiketta oikeassa työkalupalkissa\nAvaa olemassa oleva aihe napsauttamalla Aihe-ikonia 3D-näkymässä\nMuokkauspaneeli\nPerustiedot:\nNimi Aiheen nimi, näytetään 3D-näkymässä aiheen kuvakkeen päällä\nKuvaus Aiheen kuvaus monirivisenä tekstinä\nTyypi Huomio / Kommentti / Idea / Tehtävä / Ongelma / Riski / Vaatimus\nPrioriteetti Matala / Normaali / Korkea / Kriittinen\nTila Kanban-tyylinen tila aiheelle\nTunnisteet Lisää omia tunnisteita aiheisiin\nLisätietoja:\nNäkymät Aiheilla voi olla useita näkymiä\nObjektit Luettelo aiheeseen liittyvistä objekteista\nTyönkulut:\nTyönkulut ovat ennalta määriteltyjä prosesseja, joilla on vaiheita ja jokaisella vaiheella omat vastuuhenkilöt ja tarkistuslistat.\nToiminnot:\nNäkymä Tallenna näkymiä aiheeseen\nSijainti Aseta aiheen sijainti 3D:ssä\nLinkki objekteihin Valitse ja linkitä objekteja aiheeseen\nTallenna / Peruuta"},{"slug":"aiheluettelo","title":"Aiheluettelo","description":"Hae ja filteröi projektin kaikkia aiheita.","category":"Päätyökalut","content":"Aihelista-työkalua käytetään suurten määrien aiheiden hallintaan helposti järjestelyja suodatustyökalujen avulla.\nToiminnallisuus\nJärjestäminen Napsauta sarakeotsikkoa järjestääksesi sisällön\nSuodatus Napsauta suodatinikonia sarakeotsikossa määrittääksesi suodatussäännön\nNopea suodatus Napsauta solun arvoa suodataksesi vain ne arvot\nValitse Valitse aiheita käyttämällä valintaruutua taulukon vasemmalla puolella\nPoista Poista valitut aiheet Poista-painikkeella\nUusi Luo uusia aiheita\nHuom: Jos aiheita on paljon, ne on lueteltu useilla sivuilla. Voit vaihtaa sivujen välillä oikeassa alakulmassa olevasta sivutyökalusta.\nVinkit\nNapsauta nimeäsi Henkilö-kentässä, jotta voit nopeasti listata itsellesi määrätyt aiheet"},{"slug":"aiheraportti","title":"Aiheraportti","description":"Kokoa kaikki projektin aiheet yhteen taulukkoon ja tallenna Exceliin tarkempaa analysointia varten.","category":"Päätyökalut","content":"Aiheraporttityökalua käytetään kaikkien projektin aiheiden raportointiin ja tiivistämiseen helposti luettavaan taulukkoon.\nToiminnallisuus\nSelaa aiheita käyttämällä taulukkoa, jossa on vierityspalkki\nOtsikkosarakkeet näyttävät aiheiden yhteenvedon\nJos aiheilla on työnkulkuja, jokaiselle työnkululle on erillinen taulukko\nVie Vie aiheiden raportti Exceliin jatkokäyttöä varten\nVinkit\nKäytä aiheraporttia projektin tilan raportoimiseen loppuasiakkaille. Aiheraportti näyttää jokaisen projektin aiheen, niiden tilan ja työnkulkuvaiheet. Tämä luodaan automaattisesti ja säästää aikaasi."},{"slug":"aikajana","title":"Aikajana","description":"Säädä aikaa ja näe projekti esim. eri valaistusolosuhteissa.","category":"Päätyökalut","content":"Aikajanan työkalua käytetään projektin nykyisen ajan muuttamiseen, ja sitä voidaan käyttää esimerkiksi varjoanalyysiin.\nToiminnallisuus\nAseta tarkka aika päivämääräja aikavalitsimella\nSäädä aktiivista aikaa taaksepäin / eteenpäin -painikkeilla\nSiirrä aikaa hiirellä aikajanan liukusäätimellä\nToista aikajananimaatio Toista-painikkeella\nSäädä aikajanan aktiivista aikaskaalaa: tuntia / päivää / viikkoa / kuukautta / vuotta\nVinkit\nSuorita auringon varjoanalyysi aikajanalla:\n1. Ota varjot käyttöön järjestelmäasetuksissa\n2. Aseta aktiivinen aloitusaika tarkasti aikavalitsimessa\n3. Aseta aikaskaalaksi tunnit\n4. Siirrä aikajanan ohjainta vasemmalta oikealle simuloidaksesi auringonvalon varjoja eri aikoina\n5. Voit myös toistaa varjoanalyysin animaation Toista-painikkeella"},{"slug":"aineiston-hallinta","title":"Aineiston hallinta","description":"Lisää, muokkaa ja organisoi projektin tietolähteitä.","category":"Päätyökalut","content":"Aineistopuu-työkalua käytetään kaikkien projektin tietolähteiden hallintaan, niiden järjestämiseen kansioihin, käyttöoikeuksien hallintaan ja siihen, miten tiedot näkyvät 3D-näkymissä.\nTyökalupalkki\nLisää aineistoja Avataan dialogi, jossa on välilehtiä eri tietotyypeille. Valitse tietotyyppi, valitse tietotyypille spesifiset tuontiasetukset ja paina Lisää-painiketta.\nLisää kansio Lisää uuden kansion nykyisen valitun kansion alle.\nPäivitä tiedot Lataa uusi versio mallitiedostosta. Tämä luo uuden version, joka näkyy tietopuussa mallihierarkiassa.\nLataa Lataa valitun aineiston tiedosto.\nAineiston asetukset Säädä valitun tietolähteen asetuksia.\nNimeä uudelleen Uudelleennimeä tietolähde uudella nimellä.\nPiilota Tekee tietolähteen näkyviin / piilottaa sen.\nZoomaa aineistoon Siirtää nykyisen näkymän tietolähteen kokoiseksi.\nPäivitä sisäänluku Tuo valittu tietolähde uudelleen.\nPoista Poistaa valitun aineiston."},{"slug":"jarjestelma-asetukset","title":"Järjestelmäasetukset","description":"Hallitse yleisiä asetuksia, jotka vaikuttavat työkalun toimintaan.","category":"Perusteet","content":"Järjestelmäasetukset muuttavat sovelluksen toimintaa.\nYleinen\nSeuraavat asetukset voidaan nopeasti kytkeä päälle/pois:\nMaapallo Globaali maastomalli ja taustakartat. Kun pois päältä, piilottaa maaston ja taustakartat.\nProjektitaso Virtuaalinen projektitaso, jos tuonti on asetettu käyttämään \"Plane\" tilaa\nReunan pehmennys Reunan pehmennys\nVarjot Varjot auringonvalosta\nHUD Tietonäyttö renderöintinopeudesta, kuten fps\nSäästä akkua Näyttöä ei päivitetä, kun 3D-näkymässä ei tapahdu muutoksia\nHajavalaistus Hajavalaistus efekti, joka simuloi valon kimpoamista pinnoilta\nTarkastelutyökalu Erityinen työkalu mallikohteiden tarkastamiseen\nRajaava tilavuus Näyttää valitun malliaineiston tilavuudet\nAsetukset\nSeuraavia asetuksia voidaan säätää tarkasti:\nTaustaväri Säädä taustaväriä, joka näkyy, kun maapallo on asetettu pois päältä"},{"slug":"julkaisutiedot","title":"Julkaisutiedot","description":"Yhteenveto jokaisesta julkaisusta; uudet ominaisuudet, parannukset.","category":"Hallinnointi","content":"2026.01.2\nJulkaistu 30.1.2026\nParannukset\nViewpoint kamera-animaatiot\nViewpoint kuvan vienti\nMaterials-työkalu automaattiseen visualisointiin\nViewpoint videovienti kamera-animaatioille\nKMZ / KML metatietojen näyttö ObjectInfossa\nViewpoint-työkalupalkin päivitys\nKorjaukset\nLaskennan tallennusja latausongelmat\nJotkin mallit eivät näkyneet oikein tuonnin jälkeen\n4DGantt MS Project -tuonti oikein valitun alitehtävän alle\nProjektit eivät aina näkyneet Organisaation projektilistassa\nAzureAD-kirjautumisen parannukset"},{"slug":"kyselyt","title":"Kyselyt","description":"Löydä mallien objekteja jopa monipuolisten hakuehtojen avulla.","category":"Päätyökalut","content":"Kyselytyökalu on tehokas integroitu tietokantahaku, joka mahdollistaa BIM-objektien nopean löytämisen suurista projektiaineistoista.\nToiminnallisuus\nUusi Määritä uusi kyselysääntö\nTallenna Tallenna olemassa oleva kyselysääntö\nSuorita Suorita aktiivisesti valittu kyselysääntö\nSääntöeditori\nKäytä AND / OR / XOR -sääntöjä määritelläksesi useita ehtoja\nKäytä \"Kansio\" sääntöä rajoittaaksesi kyselyt tiettyyn kansion\nKäytä \"Attribuutti\" sääntöä etsiäksesi attribuuttien arvojen perusteella\nKäytä \"Tietotyyppi\" sääntöä rajoittaaksesi kyselyt tiettyihin tietotyyppeihin\nTulosten tyyli\nTulos Esitystyylit tuloksille\nMuut Esitystyylit muulle aineistolle\nVäri Kohteiden väri\nLäpinäkyvyys Kohteiden läpinäkyvyys\nNäkyvyys Pakota tulokset näkyviin / piiloon\nVinkit\nLinkitä kyselytulokset 4D Gantt -aikataulutehtäviin objektitason aikataulutuksen tekemiseksi. Tällä tavalla tehtävät löytävät aina objektit kyselysääntöjen perusteella, vaikka malleja päivitetään."},{"slug":"laskennat","title":"Laskennat","description":"Laske yhteen projektin tai mallien määriä jopa objektitasolla.","category":"Päätyökalut","content":"Laskentatyökalu on tehokas taulukkolaskenta, joka mahdollistaa laskelmat tietomalliobjektien metatietojen perusteella.\nToiminnallisuus\nUusi Luo uusi laskenta\nNimi Laskennan nimi\nTaso Laskenta perustuu tiedoston tai objektin attribuutteihin\nTallenna Tallenna nykyinen laskenta\nVie Vie nykyinen laskenta Excel-muodossa\nLaskentataulukko\nTiedot Valitse sisältö ensimmäiselle sarakkeelle\n  Kansio Erottele riveittäin aineistopuun kansiot\n  Attribuutti Erottele riveittäin objektin attribuuttien arvot\nSarake Valitse laskennan sisältö sarakkeisiin\n  Summary Laskee valittujen attribuuttien arvojen kokonaissumman\n  Quantity Laskee objektien lukumäärän\nSolusäännöt\nTaulukkolaskentataulukon solut voivat sisältää kaikenlaisia kaavoja. Lähes kaikki samat kaavat ovat tuettuina kuin Excelissä.\nVinkit\nLuo nopea kustannuslaskenta: valitse Tiedot: Ominaisuus \"Materiaali\" Sarake: Ominaisuus \"Tilavuus\". Lisää sarakkeet \"Yksikköhinta\" ja \"Kokonaishinta\" omilla kaavoilla."},{"slug":"leikkaustaso","title":"Leikkaustaso","description":"Leikkaa malleja vaaka- ja pystysuunnassa tai väylän keskilinjaa pitkin.","category":"Päätyökalut","content":"Leikkaustasotyökalua käytetään mallien leikkaamiseen auki ja poikkileikkausnäkymien luomiseen 3D-tilassa.\nVaakasuunnassa\nVaakasuuntainen leikkaustaso leikkaa mallit vaakasuunnassa. Tämä on hyödyllinen tarkastelemaan esim. rakennuksien kerrospohjia.\nPystysuunnassa\nPystysuuntainen leikkaustaso leikkaa mallit pystysuunnassa kahden pisteen välisen suoran mukaisesti. Tämä on hyödyllinen esim. rakennuksien rakenteiden tarkastelussa seinälinjan suunnassa.\nVäylän keskilinjan mukaan\nVäylän keskilinjan mukainen leikkaus leikkaa mallit pystysuuntaisen leikkauksen tapaan, mutta kohtisuoraan väylän keskilinjaa seuraten. Voit säätää leikkaustason sijaintia paaluluvun mukaan."},{"slug":"luonnosmallit","title":"Luonnosmallit","description":"Luonnostele helposti ja nopeasti 3D-objekteja, viivoja, alueita ja tilavuusmalleja erilaisiin käyttökohteisiin.","category":"Päätyökalut","content":"Luonnosmalli-työkalu on tehokas älykäs mallinnustyökalu. Luonnosmalli-työkaluja käytetään nopeiden yksinkertaisten luonnosmallien mallintamiseen.\nElementti\nLisää yksittäisiä elementtejä sijainnilla ja säteellä. Valitse 3D-malli Kirjastosta 3D-objektien sijoittamiseksi projektiin.\nSopii esimerkiksi maisemointisuunnitelmien, kaupunkikaluston ja rakennustyömaiden koneiden mallintamiseen.\nViiva\nLisää polyline-elementtejä, joissa on viivapisteet, leveys ja korkeus. Kun korkeus = 0, viiva seuraa kaikkia malleja ja maata viivan alapuolella.\nSopii esimerkiksi teiden, raiteiden, aitojen tai rakennustyömaan ojien hahmottamiseen.\nAlue\nLisää polyline-alueita kulmapisteillä ja korkeudella. Kun korkeus = 0, alue seuraa maanpintaa.\nSopii esimerkiksi rakennusmassojen, pysäköintialueiden tai puistoalueiden hahmottamiseen.\nTilavuus\nLisää tilavuusmalleja kulmapisteillä ja korkeudella.\nSopii esimerkiksi maansiirtomassojen, kaivantojen tai täyttöjen mallintamiseen."},{"slug":"mittaus","title":"Mittaus","description":"Mittaa pisteitä, etäisyyksiä, pituuksia ja pinta-aloja.","category":"Päätyökalut","content":"Mittaustyökalua käytetään mittojen ottamiseen ja merkitsemiseen 3D-näkymässä.\nMittaustyypit\nPiste Mittaa yksittäisen pisteen koordinaatit\nEtäisyys Mittaa kahden pisteen välinen etäisyys\nPituus Mittaa polyline-viivan kokonaispituus\nPinta-ala Mittaa polyline-alueen pinta-ala\nToiminnallisuus\nNapsauta 3D-näkymässä asettaaksesi mittauspisteitä\nMittaustulokset näytetään reaaliajassa\nMittaukset voidaan tallentaa projektiin"},{"slug":"nakymat","title":"Näkymät","description":"Tallenna näkymiä ja tee esityksiä erilaisista tilanteista ja skenaarioista.","category":"Päätyökalut","content":"Näkymät-työkalu on tehokas esitystyökalu, joka korvaa erilliset esitystyökalut, kuten PowerPointin. Näkymät-työkalua käytetään tallentamaan ennalta määriteltyjä näkymiä.\nToiminnallisuus\nNapsauta näkymää aktivoidaksesi sen\nNapsauta Päivitä-kuvaketta päivittääksesi näkymän\nNapsauta Poista-kuvaketta poistaaksesi näkymän\nTuplaklikkaa näkymän nimeä muokataksesi sitä\nNäkymät tallentavat ja lataavat seuraavat asetukset:\nKameranäkymä\nAikajanan aika\nTietolähteiden näkyvyys ja leikkaus\nRenderöintiasetukset kuten varjot\nVinkit\nTee interaktiivisia esityksiä näkymillä, kuten PowerPoint-diashow'ssa\nJaa esityksiä jakamalla projektilinkki katsojille"},{"slug":"navigointi","title":"Navigointi","description":"Navigoi helposti hiirellä tai kosketusnäytöillä.","category":"Perusteet","content":"Hiirellä\nHiirellä navigointi seuraa yleisistä karttasovelluksista tuttua navigointia:\nVasen nappi Panoroi tasossa paikasta toiseen pitäen samalla korkeuden ja kameran kulman ennallaan\nKeskinappi Zoomaa lähelle / kauas joko painamalla nappia ja liikuttamalla hiirtä tai käyttämällä hiiren rullaa\nOikea nappi Kierto hiiren kursorin alla olevan kohteen ympäri vaaka / pystysuunnassa\nKaikki navigoinnit ottavat hiiren alla olevan kohteen navigoinnin keskipisteeksi. Osoittamalla esim. rakennuksen kulmaa voit kiertää rakennuksen kulman ympäri.\nKosketusnäytöillä\nKosketusnäytöillä navigointi seuraa myös yleisistä karttasovelluksista tuttua navigointia:\nYksi sormi Panoroi samalla tavalla kuin hiirellä\nNipistä kahdella sormella Zoomaa lähelle tai kauas samalla tavalla kuin hiirellä\nKierrä kahdella sormella Kierto samalla tavalla kuin hiirellä"},{"slug":"nayttotilat","title":"Näyttötilat","description":"Vaihtele 2D, 3D, GPS, koko näytön ja VR tilojen välillä.","category":"Perusteet","content":"Työkalussa on seuraavat katselutilat:\n3D – Oletustila, joka näyttää näkymän 3D-perspektiivitilassa\n2D – Isometrinen ylhäältä näkymä, jota kutsutaan yleisesti myös \"karttanäkymäksi\". Poistaa perspektiivinäkymän.\nGPS – Aktivoi laitteen GPS-paikannuksen ja zoomaa laitteen sijaintiin. GPS-tilassa on myös kompassitila, joka kääntää käyttäjän näkymän suuntalaitteen kompassipisteisiin.\nVR – Aktivoi kaksoisrenderöintitilan, joka näyttää molemmille silmille renderöidyn kuvan. Voidaan käyttää VR-lasien kanssa, jotka tukevat tällaisia visualisointitiloja."},{"slug":"organisaation-hallinta","title":"Organisaation hallinta","description":"Hallitse käyttäjiä, projekteja, lisenssejä, tietokantatilaa ja kirjastoja organisaatiotasolla.","category":"Hallinnointi","content":"Organisaation hallintatyökalu on saatavilla vain organisaation pääkäyttäjille, ja sitä käytetään organisaation projektien, käyttäjien, lisenssien, käyttökiintiöiden sekä organisaatiotason kirjastojen ja lokien hallintaan.\nAsetukset\nMuokkaa organisaation perustietoja:\nLogo Logo näkyy kaikkien projektien oikeassa yläkulmassa. Käytettävissä vain, jos on ostettu erityinen whitelabel-lisenssi.\nNimi\nOsoite\nSähköpostiosoitteet uudet käyttäjät määritetään automaattisesti organisaation käyttäjiksi, jos käyttäjän sähköpostiverkkotunnus on yksi tässä luetelluista verkkotunnuksista\nProjektit\nLuettelo kaikista tässä organisaatiossa luoduista projekteista.\nLisää uusi projekti Lisää uuden projektin organisaation alle\nMuokkaa Muokkaa projektin perusasetuksia ilman, että projektia tarvitsee avata\nPoista Poistaa projektin\nKäyttäjät\nLuettelo kaikista tässä organisaatiossa luoduista käyttäjistä.\nRooli Käyttäjän rooli organisaatiossa"},{"slug":"palaute","title":"Palaute","description":"Anna rakenteellista palautetta räätälöitävillä palautelomakkeilla.","category":"Päätyökalut","content":"Palautetyökalua käytetään keräämään palautetta projektin sisäisiltä tai ulkoisilta sidosryhmiltä, kuten yleisöltä, paikallisilta asukkailta, projektin naapureilta, päättäjiltä ja muilta sidosryhmiltä.\nToiminnallisuus\nVasemmassa työkalupalkissa oleva palautepainike avaa yleisen palautelomakkeen kysymyksineen\nPalautteen \"?\" -ikonit 3D-näkymässä avaavat sijaintiin liitetyt palautelomakkeet\nJokainen palautelomake on erilainen ja sen määrittelee projektitiimi\nVastaa palautekysymyksiin ja paina Lähetä-painiketta"},{"slug":"palauteraportti","title":"Palauteraportti","description":"Kokoa yhteen taulukkoon kaikki palautteet ja tallenna Exceliin tarkempaa analysointia varten.","category":"Päätyökalut","content":"Palauteraporttia käytetään kaikkien palautteiden yhdistämiseen yhteen taulukkoon helpottamaan palautteen analysointia.\nToiminnallisuus\nVieritä palautteen vastauksia taulukossa\nVie palautetaulukko Excel-tiedostona jatkoanalyysiä varten\nHymiövastaukset tallennetaan numeroina Excel-tiedostoon hymiökuvakkeen järjestyksessä (oletus 0 = erittäin onnellinen ja 4 = erittäin onneton)\nVinkit\nSuorita palautetilastot Excelissä laskemalla palautetulosten keskiarvo, mediaani jne.\nAnalysoi palautetta tekoälyn avulla lataamalla palauteraportti Exceliin ja kysymällä kysymyksiä tekoälyltä"},{"slug":"piilota","title":"Piilota","description":"Piilota kohteita tai alueita aineistoista.","category":"Päätyökalut","content":"Piilota-työkalua käytetään piilottamaan osia olemassa olevista tietoaineistoista projektitasolla. Voit esimerkiksi piilottaa purettavat rakennukset uusien alta pois.\nPiilota objektit\nTyökalu värittää esineitä, jotka voit piilottaa satunnaisilla väreillä\nValitse 3D-näkymässä ne objektit, jotka haluat piilottaa. Valitut objektit muuttuvat punaisiksi.\nValitse punaiset objektit, jotka haluat takaisin näkyviin, tai käytä \"Näytä kaikki\" -painiketta.\nTallenna-painike tallentaa piilotettujen objektien listan\nPiilota Alue\nAluepainike käynnistää alueen piirtotoiminnon\nPiirrä polyline alueen ympärille, jonka haluat piilottaa\nLopuksi napsauta hiiren oikeaa painiketta lopettaaksesi piirtämisen"},{"slug":"profiiliasetukset","title":"Profiiliasetukset","description":"Hallitse käyttäjän profiilin tietoja ja asetuksia.","category":"Perusteet","content":"Profiilin asetuksia käytetään käyttäjäprofiilin muokkaamiseen:\nProfiilikuva – Käyttäjän henkilökohtainen kuva. Tällä hetkellä ei käytössä, varattu tuleville uusille ominaisuuksille.\nKäyttäjätunnus – Muuta käyttäjän käyttäjätunnusta, joka on käyttäjän kutsunimi useissa työkaluissa.\nSähköposti – Vaihda käyttäjän sähköpostiosoite. Tämä edellyttää, että sähköposti toimii, koska uusi sähköpostiosoite vahvistetaan, ennen kuin se aktivoituu.\nEtuja sukunimet – Käyttäjän oikea nimi\nKieli – Käyttöliittymässä käytetty kieli. 6DPlanner on käännetty useille kielille, joten käyttäjät voivat käyttää työkalua äidinkielellään. Kieliasetus vaikuttaa myös siihen, miten numerot, päivämäärät ja muut arvot näytetään.\nPoista tilini – Poista käyttäjätili. Ole varovainen käyttäessäsi tätä, koska sitä ei voi palauttaa. Käyttäjät poistetaan järjestelmästä pysyvästi.\nVaihda salasana – Vaihda käyttäjän salasana."},{"slug":"projektiluettelo","title":"Projektiluettelo","description":"Hallitse käyttäjän omia projekteja ja luo uusia projekteja.","category":"Perusteet","content":"Projektiluettelo näyttää kaikki projektit, joiden jäsen olet. Luettelo on jaettu kolmeen osaan:\nOmat projektit – sinun luomasi projektit\nKutsutut projektit – projektit, joihin muut käyttäjät ovat kutsuneet sinut\nProjektipohjat projektipohjat, joita käytetään uusien projektien luomiseen\nJokaisessa projektissa on painikkeet projektien hallintaan:\nProjektiasetukset – Käytä projektin perusasetuksia suoraan avaamatta projektia\nPoistu – Poistu projektista, johon olet liittynyt kutsusta. Tämä koskee vain kutsuttuja projekteja.\nMonista projekti – Luo kopion projektista, esimerkiksi luodaksesi useita versioita samasta projektista\nPoista – Poistaa projektin. Poistetut projektit merkitään vain poistetuiksi ja tietoja säilytetään 30 päivää vahingossa tapahtuvien poistojen varalta. Jos haluat palauttaa projektin, ota yhteyttä tukeen. 30 päivän kuluttua poistettua projektia ei voi enää palauttaa."},{"slug":"projektin-asetukset","title":"Projektin asetukset","description":"Hallitse käyttäjiä, rooleja, ominaisuustietoja, kirjastoja, palautelomakkeita, työnkulkuja ja muita asetuksia projektitasolla.","category":"Perusteet","content":"Projektin asetukset määrittelevät projektikohtaiset asetukset eri työkaluja varten.\nHuom: Jotkin asetukset ovat saatavilla vain projektipäällikkö-käyttäjärooleille.\nYleiset asetukset\nProjektin kuva\nProjektikuva mahdollistaa projektin pikkukuvan asettamisen projektilistassa. Oletusarvoisesti se luodaan automaattisesti projektin ensimmäisestä näkymästä.\nAloituskuva\nAloituskuva mahdollistaa mukautetun pika-avun kuvan asettamisen, joka näytetään käyttäjille, kun he avaavat projektin.\nProjektin nimi\nProjektin nimi näkyy projektilistassa ja selaimen otsikossa verkkosivun nimenä.\nKoordinaattijärjestelmä\nAktiivinen koordinaattijärjestelmä, jota käytetään esimerkiksi mallin sijoittamisessa tai koordinaattien näyttämisessä Mittaustyökalussa."},{"slug":"tekninen-dokumentaatio","title":"Tekninen dokumentaatio","description":"Tekninen dokumentaatio organisaation IT-hallinnolle.","category":"Hallinnointi","content":"(English only as technical terminology is more clear in English)\nArchitecture\n6DPlanner is implemented on top of AWS (Amazon Web Services) cloud architecture and infrastructure. The servers and data are located in AWS data centers close to users, depending on user's region.\nThe service is based on a modern \"serverless\" cloud architecture, where processes are started as needed in parallel, which theoretically enables unlimited scalability based on usage needs.\nHigh performance end user experience on client devices has been implemented with unique intelligent multi-resolution object level web streaming CesiumJS technology, which enables dynamic loading of data based on the viewer's location."},{"slug":"tilannekuva","title":"Tilannekuva","description":"Näe nopeasti projektin tilanne yhden kokoavan visuaalisen taulun kautta.","category":"Päätyökalut","content":"Tilannekuva-työkalua käytetään projektin tilan tiivistämiseen yhden sivun tyyppiseen tilaraporttiin, jossa on useita analyyttisiä näkymiä.\nToiminnallisuus\nAikavälin valitsin Valitse aikaväli, jolle tilanneraportti kerätään\nAiheet Piirakka ja Taulukko Näyttää aiheiden yhteenvedon piirakkakaaviona ja taulukkona\nNopeus Analyysi siitä, kuinka nopeasti aiheet etenevät tai suljetaan\nAktiiviset aiheet Kaavio aiheiden edistymishistoriasta\nProjektin valmiusaste Näyttää, kuinka valmis projekti on aiheiden tilojen perusteella\nVinkit\nKäytä tätä automaattista tilannekuvapaneelia viestiäksesi projektin tilasta sidosryhmille."}]